apache/nuttx/arch/arm/src/efm32/hardware/efm32_usb.h
/****************************************************************************
 * arch/arm/src/efm32/hardware/efm32_usb.h
 *
 *  Copyright 2014 Silicon Laboratories, Inc. http://www.silabs.com</b>
 *
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software.@n
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.@n
 * 3. This notice may not be removed or altered from any source distribution.
 *
 * DISCLAIMER OF WARRANTY/LIMITATION OF REMEDIES: Silicon Laboratories, Inc.
 * has no obligation to support this Software. Silicon Laboratories, Inc. is
 * providing the Software "AS IS", with no express or implied warranties of
 * any kind, including, but not limited to, any implied warranties of
 * merchantability or fitness for any particular purpose or warranties
 * against infringement of any proprietary rights of a third party.
 *
 * Silicon Laboratories, Inc. will not be liable for any consequential,
 * incidental, or special damages, or any other relief, or for any claim by
 * any third party, arising from your use of this Software.
 *
 *   Copyright (C) 2014 Pierre-noel Bouteville . All rights reserved.
 *   Copyright (C) 2014 Gregory Nutt. All rights reserved.
 *   Authors: Pierre-noel Bouteville <pnb990@gmail.com>
 *            Gregory Nutt <gnutt@nuttx.org>
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in
 *    the documentation and/or other materials provided with the
 *    distribution.
 * 3. Neither the name NuttX nor the names of its contributors may be
 *    used to endorse or promote products derived from this software
 *    without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE
 * COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
 * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS
 * OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
 * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 ****************************************************************************/

#ifndef __ARCH_ARM_SRC_EFM32_HARDWARE_EFM32_USB_H
#define __ARCH_ARM_SRC_EFM32_HARDWARE_EFM32_USB_H

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>
#include "hardware/efm32_memorymap.h"

#if !defined(CONFIG_EFM32_EFM32GG)
#  pragma message "This is the EFM32GG header file; Review/modification needed for this architecture"
#endif

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* General definitions */

#define EFM32_USB_EPTYPE_CTRL                      (0)      /* Control */
#define EFM32_USB_EPTYPE_ISOC                      (1)      /* Isochronous */
#define EFM32_USB_EPTYPE_BULK                      (2)      /* Bulk */
#define EFM32_USB_EPTYPE_INTR                      (3)      /* Interrupt */

#define EFM32_USB_PID_DATA0                        (0)
#define EFM32_USB_PID_DATA2                        (1)
#define EFM32_USB_PID_DATA1                        (2)
#define EFM32_USB_PID_MDATA                        (3)      /* Non-control */
#define EFM32_USB_PID_SETUP                        (3)      /* Control */

/* USB Register Offsets *****************************************************/

#define EFM32_USB_CTRL_OFFSET                      0x00000  /* System Control Register */
#define EFM32_USB_STATUS_OFFSET                    0x00004  /* System Status Register */
#define EFM32_USB_IF_OFFSET                        0x00008  /* Interrupt Flag Register */
#define EFM32_USB_IFS_OFFSET                       0x0000c  /* Interrupt Flag Set Register */
#define EFM32_USB_IFC_OFFSET                       0x00010  /* Interrupt Flag Clear Register */
#define EFM32_USB_IEN_OFFSET                       0x00014  /* Interrupt Enable Register */
#define EFM32_USB_ROUTE_OFFSET                     0x00018  /* I/O Routing Register */

#define EFM32_USB_GOTGCTL_OFFSET                   0x3c000  /* OTG Control and Status Register */
#define EFM32_USB_GOTGINT_OFFSET                   0x3c004  /* OTG Interrupt Register */
#define EFM32_USB_GAHBCFG_OFFSET                   0x3c008  /* AHB Configuration Register */
#define EFM32_USB_GUSBCFG_OFFSET                   0x3c00c  /* USB Configuration Register */
#define EFM32_USB_GRSTCTL_OFFSET                   0x3c010  /* Reset Register */
#define EFM32_USB_GINTSTS_OFFSET                   0x3c014  /* Interrupt Register */
#define EFM32_USB_GINTMSK_OFFSET                   0x3c018  /* Interrupt Mask Register */
#define EFM32_USB_GRXSTSR_OFFSET                   0x3c01c  /* Receive Status Debug Read Register */
#define EFM32_USB_GRXSTSP_OFFSET                   0x3c020  /* Receive Status Read and Pop Register */
#define EFM32_USB_GRXFSIZ_OFFSET                   0x3c024  /* Receive FIFO Size Register */
#define EFM32_USB_GNPTXFSIZ_OFFSET                 0x3c028  /* Non-periodic Transmit FIFO Size Register */
#define EFM32_USB_DIEPTXF0_OFFSET                  0x3c028  /* Endpoint 0 Transmit FIFO size */
#define EFM32_USB_GNPTXSTS_OFFSET                  0x3c02c  /* Non-periodic Transmit FIFO/Queue Status Register */
#define EFM32_USB_GDFIFOCFG_OFFSET                 0x3c05c  /* Global DFIFO Configuration Register */
#define EFM32_USB_HPTXFSIZ_OFFSET                  0x3c100  /* Host Periodic Transmit FIFO Size Register */

#define EFM32_USB_DIEPTXF_OFFSET(n)                (0x3c104 + (((n)-1) << 2))
#define EFM32_USB_DIEPTXF1_OFFSET                  0x3c104  /* Device IN Endpoint Transmit FIFO 1 Size Register */
#define EFM32_USB_DIEPTXF2_OFFSET                  0x3c108  /* Device IN Endpoint Transmit FIFO 2 Size Register */
#define EFM32_USB_DIEPTXF3_OFFSET                  0x3c10c  /* Device IN Endpoint Transmit FIFO 3 Size Register */
#define EFM32_USB_DIEPTXF4_OFFSET                  0x3c110  /* Device IN Endpoint Transmit FIFO 4 Size Register */
#define EFM32_USB_DIEPTXF5_OFFSET                  0x3c114  /* Device IN Endpoint Transmit FIFO 5 Size Register */
#define EFM32_USB_DIEPTXF6_OFFSET                  0x3c118  /* Device IN Endpoint Transmit FIFO 6 Size Register */

