apache/nuttx/arch/arm/src/efm32/hardware/efm32_usb.h
#define EFM32_USB_HCFG_OFFSET                      0x3c400  /* Host Configuration Register */
#define EFM32_USB_HFIR_OFFSET                      0x3c404  /* Host Frame Interval Register */
#define EFM32_USB_HFNUM_OFFSET                     0x3c408  /* Host Frame Number/Frame Time Remaining Register */
#define EFM32_USB_HPTXSTS_OFFSET                   0x3c410  /* Host Periodic Transmit FIFO/Queue Status Register */
#define EFM32_USB_HAINT_OFFSET                     0x3c414  /* Host All Channels Interrupt Register */
#define EFM32_USB_HAINTMSK_OFFSET                  0x3c418  /* Host All Channels Interrupt Mask Register */
#define EFM32_USB_HPRT_OFFSET                      0x3c440  /* Host Port Control and Status Register */

#define EFM32_USB_HC_OFFSET(n)                     (0x3c500 + ((n) << 5))
#define EFM32_USB_HC0_OFFSET                       0x3c500  /* Host Channel 0 Offset */
#define EFM32_USB_HC1_OFFSET                       0x3c520  /* Host Channel 1 Offset */
#define EFM32_USB_HC2_OFFSET                       0x3c540  /* Host Channel 2 Offset */
#define EFM32_USB_HC3_OFFSET                       0x3c560  /* Host Channel 3 Offset */
#define EFM32_USB_HC4_OFFSET                       0x3c580  /* Host Channel 4 Offset */
#define EFM32_USB_HC5_OFFSET                       0x3c5a0  /* Host Channel 5 Offset */
#define EFM32_USB_HC6_OFFSET                       0x3c5c0  /* Host Channel 6 Offset */
#define EFM32_USB_HC7_OFFSET                       0x3c5e0  /* Host Channel 7 Offset */
#define EFM32_USB_HC8_OFFSET                       0x3c600  /* Host Channel 8 Offset */
#define EFM32_USB_HC9_OFFSET                       0x3c620  /* Host Channel 9 Offset */
#define EFM32_USB_HC10_OFFSET                      0x3c640  /* Host Channel 10 Offset */
#define EFM32_USB_HC11_OFFSET                      0x3c660  /* Host Channel 11 Offset */
#define EFM32_USB_HC12_OFFSET                      0x3c680  /* Host Channel 12 Offset */
#define EFM32_USB_HC13_OFFSET                      0x3c6a0  /* Host Channel 13 Offset */

#define EFM32_USB_HC_CHAR_OFFSET                   0x00000  /* Host Channel n Characteristics Register */
#define EFM32_USB_HC_INT_OFFSET                    0x00008  /* Host Channel n Interrupt Register */
#define EFM32_USB_HC_INTMSK_OFFSET                 0x0000c  /* Host Channel n Interrupt Mask Register */
#define EFM32_USB_HC_TSIZ_OFFSET                   0x00010  /* Host Channel n Transfer Size Register */
#define EFM32_USB_HC_DMAADDR_OFFSET                0x00014  /* Host Channel n DMA Address Register */

#define EFM32_USB_DCFG_OFFSET                      0x3c800  /* Device Configuration Register */
#define EFM32_USB_DCTL_OFFSET                      0x3c804  /* Device Control Register */
#define EFM32_USB_DSTS_OFFSET                      0x3c808  /* Device Status Register */
#define EFM32_USB_DIEPMSK_OFFSET                   0x3c810  /* Device IN Endpoint Common Interrupt Mask Register */
#define EFM32_USB_DOEPMSK_OFFSET                   0x3c814  /* Device OUT Endpoint Common Interrupt Mask Register */
#define EFM32_USB_DAINT_OFFSET                     0x3c818  /* Device All Endpoints Interrupt Register */
#define EFM32_USB_DAINTMSK_OFFSET                  0x3c81c  /* Device All Endpoints Interrupt Mask Register */
#define EFM32_USB_DVBUSDIS_OFFSET                  0x3c828  /* Device VBUS Discharge Time Register */
#define EFM32_USB_DVBUSPULSE_OFFSET                0x3c82C  /* Device VBUS Pulsing Time Register */
#define EFM32_USB_DIEPEMPMSK_OFFSET                0x3c834  /* Device IN Endpoint FIFO Empty Interrupt Mask Register */

#define EFM32_USB_DIEP_OFFSET(n)                   (0x3c900 + ((n) << 5))
#define EFM32_USB_DIEP0_OFFSET                     0x3c900   /* Device IN Endpoint 0 */
#define EFM32_USB_DIEP1_OFFSET                     0x3c920   /* Device IN Endpoint 1 */
#define EFM32_USB_DIEP2_OFFSET                     0x3c940   /* Device IN Endpoint 2 */
#define EFM32_USB_DIEP3_OFFSET                     0x3c960   /* Device IN Endpoint 3 */
#define EFM32_USB_DIEP4_OFFSET                     0x3c980   /* Device IN Endpoint 4 */
#define EFM32_USB_DIEP5_OFFSET                     0x3c9a0   /* Device IN Endpoint 5 */
#define EFM32_USB_DIEP6_OFFSET                     0x3c9c0   /* Device IN Endpoint 6 */

#define EFM32_USB_DIEPnCTL_OFFSET                  0x00000  /* Device IN Endpoint n Control Register */
#define EFM32_USB_DIEPnINT_OFFSET                  0x00008  /* Device IN Endpoint n Interrupt Register */
#define EFM32_USB_DIEPnTSIZ_OFFSET                 0x00010  /* Device IN Endpoint n Transfer Size Register */
#define EFM32_USB_DIEPnDMAADDR_OFFSET              0x00014  /* Device IN Endpoint n DMA Address Register */
#define EFM32_USB_DIEPnTXFSTS_OFFSET               0x00018  /* Device IN Endpoint n Transmit FIFO Status Register */

#define EFM32_USB_DIEP0CTL_OFFSET                  0x3c900  /* Device IN Endpoint 0 Control Register */
#define EFM32_USB_DIEP0INT_OFFSET                  0x3c908  /* Device IN Endpoint 0 Interrupt Register */
#define EFM32_USB_DIEP0TSIZ_OFFSET                 0x3c910  /* Device IN Endpoint 0 Transfer Size Register */
#define EFM32_USB_DIEP0DMAADDR_OFFSET              0x3c914  /* Device IN Endpoint 0 DMA Address Register */
#define EFM32_USB_DIEP0TXFSTS_OFFSET               0x3c918  /* Device IN Endpoint 0 Transmit FIFO Status Register */

#define EFM32_USB_DIEP1CTL_OFFSET                  0x3c920  /* Device IN Endpoint 1 Control Register */
#define EFM32_USB_DIEP1INT_OFFSET                  0x3c928  /* Device IN Endpoint 1 Interrupt Register */
#define EFM32_USB_DIEP1TSIZ_OFFSET                 0x3c930  /* Device IN Endpoint 1 Transfer Size Register */
#define EFM32_USB_DIEP1DMAADDR_OFFSET              0x3c934  /* Device IN Endpoint 1 DMA Address Register */
#define EFM32_USB_DIEP1TXFSTS_OFFSET               0x3c938  /* Device IN Endpoint 1 Transmit FIFO Status Register */

#define EFM32_USB_DIEP2CTL_OFFSET                  0x3c940  /* Device IN Endpoint 2 Control Register */
#define EFM32_USB_DIEP2INT_OFFSET                  0x3c948  /* Device IN Endpoint 2 Interrupt Register */
#define EFM32_USB_DIEP2TSIZ_OFFSET                 0x3c950  /* Device IN Endpoint 2 Transfer Size Register */
#define EFM32_USB_DIEP2DMAADDR_OFFSET              0x3c954  /* Device IN Endpoint 2 DMA Address Register */
#define EFM32_USB_DIEP2TXFSTS_OFFSET               0x3c958  /* Device IN Endpoint 2 Transmit FIFO Status Register */

#define EFM32_USB_DIEP3CTL_OFFSET                  0x3c960  /* Device IN Endpoint 3 Control Register */
#define EFM32_USB_DIEP3INT_OFFSET                  0x3c968  /* Device IN Endpoint 3 Interrupt Register */
#define EFM32_USB_DIEP3TSIZ_OFFSET                 0x3c970  /* Device IN Endpoint 3 Transfer Size Register */
#define EFM32_USB_DIEP3DMAADDR_OFFSET              0x3c974  /* Device IN Endpoint 3 DMA Address Register */
#define EFM32_USB_DIEP3TXFSTS_OFFSET               0x3c978  /* Device IN Endpoint 3 Transmit FIFO Status Register */

#define EFM32_USB_DIEP4CTL_OFFSET                  0x3c980  /* Device IN Endpoint 4 Control Register */
#define EFM32_USB_DIEP4INT_OFFSET                  0x3c988  /* Device IN Endpoint 4 Interrupt Register */
#define EFM32_USB_DIEP4TSIZ_OFFSET                 0x3c990  /* Device IN Endpoint 4 Transfer Size Register */
#define EFM32_USB_DIEP4DMAADDR_OFFSET              0x3c994  /* Device IN Endpoint 4 DMA Address Register */
#define EFM32_USB_DIEP4TXFSTS_OFFSET               0x3c998  /* Device IN Endpoint 4 Transmit FIFO Status Register */

#define EFM32_USB_DIEP5CTL_OFFSET                  0x3c9a0  /* Device IN Endpoint 5 Control Register */
#define EFM32_USB_DIEP5INT_OFFSET                  0x3c9a8  /* Device IN Endpoint 5 Interrupt Register */
#define EFM32_USB_DIEP5TSIZ_OFFSET                 0x3c9b0  /* Device IN Endpoint 5 Transfer Size Register */
#define EFM32_USB_DIEP5DMAADDR_OFFSET              0x3c9b4  /* Device IN Endpoint 5 DMA Address Register */
#define EFM32_USB_DIEP5TXFSTS_OFFSET               0x3c9b8  /* Device IN Endpoint 5 Transmit FIFO Status Register */

#define EFM32_USB_DIEP6CTL_OFFSET                  0x3c9c0  /* Device IN Endpoint 6 Control Register */
#define EFM32_USB_DIEP6INT_OFFSET                  0x3c9c8  /* Device IN Endpoint 6 Interrupt Register */
#define EFM32_USB_DIEP6TSIZ_OFFSET                 0x3c9d0  /* Device IN Endpoint 6 Transfer Size Register */
#define EFM32_USB_DIEP6DMAADDR_OFFSET              0x3c9d4  /* Device IN Endpoint 6 DMA Address Register */
#define EFM32_USB_DIEP6TXFSTS_OFFSET               0x3c9d8  /* Device IN Endpoint 6 Transmit FIFO Status Register */

#define EFM32_USB_DOEP_OFFSET(n)                   (0x3cb00 + ((n) << 5))
#define EFM32_USB_DOEP0_OFFSET                     0x3cb00   /* Device OUT Endpoint 0 */
#define EFM32_USB_DOEP1_OFFSET                     0x3cb20   /* Device OUT Endpoint 1 */
#define EFM32_USB_DOEP2_OFFSET                     0x3cb40   /* Device OUT Endpoint 2 */
#define EFM32_USB_DOEP3_OFFSET                     0x3cb60   /* Device OUT Endpoint 3 */
#define EFM32_USB_DOEP4_OFFSET                     0x3cb80   /* Device OUT Endpoint 4 */
#define EFM32_USB_DOEP5_OFFSET                     0x3cba0   /* Device OUT Endpoint 5 */
#define EFM32_USB_DOEP6_OFFSET                     0x3cbc0   /* Device OUT Endpoint 6 */

#define EFM32_USB_DOEPnCTL_OFFSET                  0x00000  /* Device OUT Endpoint n Control Register */
#define EFM32_USB_DOEPnINT_OFFSET                  0x00008  /* Device OUT Endpoint n Interrupt Register */
#define EFM32_USB_DOEPnTSIZ_OFFSET                 0x00010  /* Device OUT Endpoint n Transfer Size Register */
#define EFM32_USB_DOEPnDMAADDR_OFFSET              0x00014  /* Device OUT Endpoint n DMA Address Register */

#define EFM32_USB_DOEP0CTL_OFFSET                  0x3cb00  /* Device OUT Endpoint 0 Control Register */
#define EFM32_USB_DOEP0INT_OFFSET                  0x3cb08  /* Device OUT Endpoint 0 Interrupt Register */
#define EFM32_USB_DOEP0TSIZ_OFFSET                 0x3cb10  /* Device OUT Endpoint 0 Transfer Size Register */
#define EFM32_USB_DOEP0DMAADDR_OFFSET              0x3cb14  /* Device OUT Endpoint 0 DMA Address Register */

