apache/nuttx/arch/arm/src/efm32/hardware/efm32_usb.h
#define EFM32_USB_DOEP1CTL_OFFSET                  0x3cb20  /* Device OUT Endpoint x Control Register */
#define EFM32_USB_DOEP1INT_OFFSET                  0x3cb28  /* Device OUT Endpoint x Interrupt Register */
#define EFM32_USB_DOEP1TSIZ_OFFSET                 0x3cb30  /* Device OUT Endpoint x Transfer Size Register */
#define EFM32_USB_DOEP1DMAADDR_OFFSET              0x3cb34  /* Device OUT Endpoint x DMA Address Register */

#define EFM32_USB_DOEP2_CTL_OFFSET                 0x3cb40  /* Device OUT Endpoint x Control Register */
#define EFM32_USB_DOEP2_INT_OFFSET                 0x3cb48  /* Device OUT Endpoint x Interrupt Register */
#define EFM32_USB_DOEP2_TSIZ_OFFSET                0x3cb50  /* Device OUT Endpoint x Transfer Size Register */
#define EFM32_USB_DOEP2_DMAADDR_OFFSET             0x3cb54  /* Device OUT Endpoint x DMA Address Register */

#define EFM32_USB_DOEP3CTL_OFFSET                  0x3cb60  /* Device OUT Endpoint x Control Register */
#define EFM32_USB_DOEP3INT_OFFSET                  0x3cb68  /* Device OUT Endpoint x Interrupt Register */
#define EFM32_USB_DOEP3TSIZ_OFFSET                 0x3cb70  /* Device OUT Endpoint x Transfer Size Register */
#define EFM32_USB_DOEP3DMAADDR_OFFSET              0x3cb74  /* Device OUT Endpoint x DMA Address Register */

#define EFM32_USB_DOEP4CTL_OFFSET                  0x3cb80  /* Device OUT Endpoint x Control Register */
#define EFM32_USB_DOEP4INT_OFFSET                  0x3cb88  /* Device OUT Endpoint x Interrupt Register */
#define EFM32_USB_DOEP4TSIZ_OFFSET                 0x3cb90  /* Device OUT Endpoint x Transfer Size Register */
#define EFM32_USB_DOEP4DMAADDR_OFFSET              0x3cb94  /* Device OUT Endpoint x DMA Address Register */

#define EFM32_USB_DOEP5CTL_OFFSET                  0x3cba0  /* Device OUT Endpoint x Control Register */
#define EFM32_USB_DOEP5INT_OFFSET                  0x3cba8  /* Device OUT Endpoint x Interrupt Register */
#define EFM32_USB_DOEP5TSIZ_OFFSET                 0x3cbb0  /* Device OUT Endpoint x Transfer Size Register */
#define EFM32_USB_DOEP5DMAADDR_OFFSET              0x3cbb4  /* Device OUT Endpoint x DMA Address Register */

#define EFM32_USB_DOEP6CTL_OFFSET                  0x3cbc0  /* Device OUT Endpoint x Control Register */
#define EFM32_USB_DOEP6INT_OFFSET                  0x3cbc8  /* Device OUT Endpoint x Interrupt Register */
#define EFM32_USB_DOEP6TSIZ_OFFSET                 0x3cbd0  /* Device OUT Endpoint x Transfer Size Register */
#define EFM32_USB_DOEP6DMAADDR_OFFSET              0x3cbd4  /* Device OUT Endpoint x DMA Address Register */

#define EFM32_USB_PCGCCTL_OFFSET                   0x3ce00  /* Power and Clock Gating Control Register */

/* Device EP/Host Channel FIFOs */

#define EFM32_USB_FIFO_OFFSET(n)                   (0x3d000 + ((n) << 12))
#define EFM32_USB_FIFO0_OFFSET                     0x3d000
#define EFM32_USB_FIFO1_OFFSET                     0x3e000
#define EFM32_USB_FIFO2_OFFSET                     0x3f000
#define EFM32_USB_FIFO3_OFFSET                     0x40000
#define EFM32_USB_FIFO4_OFFSET                     0x41000
#define EFM32_USB_FIFO5_OFFSET                     0x42000
#define EFM32_USB_FIFO6_OFFSET                     0x43000
#define EFM32_USB_FIFO7_OFFSET                     0x44000
#define EFM32_USB_FIFO8_OFFSET                     0x45000
#define EFM32_USB_FIFO9_OFFSET                     0x46000
#define EFM32_USB_FIFO10_OFFSET                    0x47000
#define EFM32_USB_FIFO11_OFFSET                    0x48000
#define EFM32_USB_FIFO12_OFFSET                    0x49000
#define EFM32_USB_FIFO13_OFFSET                    0x4a000

#define EFM32_USB_FIFOD_OFFSET(n,d)               (EFM32_USB_FIFO_OFFSET(n) + ((d) << 2))
#define EFM32_FIFORAM_OFFSET(d)                   (0x5c000 + ((d) << 2))

/* USB Register Addresses ***************************************************/

#define EFM32_USB_CTRL                             (EFM32_USB_BASE+EFM32_USB_CTRL_OFFSET)
#define EFM32_USB_STATUS                           (EFM32_USB_BASE+EFM32_USB_STATUS_OFFSET)
#define EFM32_USB_IF                               (EFM32_USB_BASE+EFM32_USB_IF_OFFSET)
#define EFM32_USB_IFS                              (EFM32_USB_BASE+EFM32_USB_IFS_OFFSET)
#define EFM32_USB_IFC                              (EFM32_USB_BASE+EFM32_USB_IFC_OFFSET)
#define EFM32_USB_IEN                              (EFM32_USB_BASE+EFM32_USB_IEN_OFFSET)
#define EFM32_USB_ROUTE                            (EFM32_USB_BASE+EFM32_USB_ROUTE_OFFSET)

#define EFM32_USB_GOTGCTL                          (EFM32_USB_BASE+EFM32_USB_GOTGCTL_OFFSET)
#define EFM32_USB_GOTGINT                          (EFM32_USB_BASE+EFM32_USB_GOTGINT_OFFSET)
#define EFM32_USB_GAHBCFG                          (EFM32_USB_BASE+EFM32_USB_GAHBCFG_OFFSET)
#define EFM32_USB_GUSBCFG                          (EFM32_USB_BASE+EFM32_USB_GUSBCFG_OFFSET)
#define EFM32_USB_GRSTCTL                          (EFM32_USB_BASE+EFM32_USB_GRSTCTL_OFFSET)
#define EFM32_USB_GINTSTS                          (EFM32_USB_BASE+EFM32_USB_GINTSTS_OFFSET)
#define EFM32_USB_GINTMSK                          (EFM32_USB_BASE+EFM32_USB_GINTMSK_OFFSET)
#define EFM32_USB_GRXSTSR                          (EFM32_USB_BASE+EFM32_USB_GRXSTSR_OFFSET)
#define EFM32_USB_GRXSTSP                          (EFM32_USB_BASE+EFM32_USB_GRXSTSP_OFFSET)
#define EFM32_USB_GRXFSIZ                          (EFM32_USB_BASE+EFM32_USB_GRXFSIZ_OFFSET)
#define EFM32_USB_GNPTXFSIZ                        (EFM32_USB_BASE+EFM32_USB_GNPTXFSIZ_OFFSET)
#define EFM32_USB_DIEPTXF0                         (EFM32_USB_BASE+EFM32_USB_DIEPTXF0_OFFSET)
#define EFM32_USB_GNPTXSTS                         (EFM32_USB_BASE+EFM32_USB_GNPTXSTS_OFFSET)
#define EFM32_USB_GDFIFOCFG                        (EFM32_USB_BASE+EFM32_USB_GDFIFOCFG_OFFSET)
#define EFM32_USB_HPTXFSIZ                         (EFM32_USB_BASE+EFM32_USB_HPTXFSIZ_OFFSET)

#define EFM32_USB_DIEPTXF(n)                       (EFM32_USB_BASE+EFM32_USB_DIEPTXF_OFFSET(n))
#define EFM32_USB_DIEPTXF1                         (EFM32_USB_BASE+EFM32_USB_DIEPTXF1_OFFSET)
#define EFM32_USB_DIEPTXF2                         (EFM32_USB_BASE+EFM32_USB_DIEPTXF2_OFFSET)
#define EFM32_USB_DIEPTXF3                         (EFM32_USB_BASE+EFM32_USB_DIEPTXF3_OFFSET)
#define EFM32_USB_DIEPTXF4                         (EFM32_USB_BASE+EFM32_USB_DIEPTXF4_OFFSET)
#define EFM32_USB_DIEPTXF5                         (EFM32_USB_BASE+EFM32_USB_DIEPTXF5_OFFSET)
#define EFM32_USB_DIEPTXF6                         (EFM32_USB_BASE+EFM32_USB_DIEPTXF6_OFFSET)

#define EFM32_USB_HCFG                             (EFM32_USB_BASE+EFM32_USB_HCFG_OFFSET)
#define EFM32_USB_HFIR                             (EFM32_USB_BASE+EFM32_USB_HFIR_OFFSET)
#define EFM32_USB_HFNUM                            (EFM32_USB_BASE+EFM32_USB_HFNUM_OFFSET)
#define EFM32_USB_HPTXSTS                          (EFM32_USB_BASE+EFM32_USB_HPTXSTS_OFFSET)
#define EFM32_USB_HAINT                            (EFM32_USB_BASE+EFM32_USB_HAINT_OFFSET)
#define EFM32_USB_HAINTMSK                         (EFM32_USB_BASE+EFM32_USB_HAINTMSK_OFFSET)
#define EFM32_USB_HPRT                             (EFM32_USB_BASE+EFM32_USB_HPRT_OFFSET)

#define EFM32_USB_HC_BASE(n)                       (EFM32_USB_BASE+EFM32_USB_HC_OFFSET(n))
#define EFM32_USB_HC0_BASE                         (EFM32_USB_BASE+EFM32_USB_HC0_OFFSET)
#define EFM32_USB_HC1_BASE                         (EFM32_USB_BASE+EFM32_USB_HC1_OFFSET)
#define EFM32_USB_HC2_BASE                         (EFM32_USB_BASE+EFM32_USB_HC2_OFFSET)
#define EFM32_USB_HC3_BASE                         (EFM32_USB_BASE+EFM32_USB_HC3_OFFSET)
#define EFM32_USB_HC4_BASE                         (EFM32_USB_BASE+EFM32_USB_HC4_OFFSET)
#define EFM32_USB_HC5_BASE                         (EFM32_USB_BASE+EFM32_USB_HC5_OFFSET)
#define EFM32_USB_HC6_BASE                         (EFM32_USB_BASE+EFM32_USB_HC6_OFFSET)
#define EFM32_USB_HC7_BASE                         (EFM32_USB_BASE+EFM32_USB_HC7_OFFSET)
#define EFM32_USB_HC8_BASE                         (EFM32_USB_BASE+EFM32_USB_HC8_OFFSET)
#define EFM32_USB_HC9_BASE                         (EFM32_USB_BASE+EFM32_USB_HC9_OFFSET)
#define EFM32_USB_HC10_BASE                        (EFM32_USB_BASE+EFM32_USB_HC10_OFFSET)
#define EFM32_USB_HC11_BASE                        (EFM32_USB_BASE+EFM32_USB_HC11_OFFSET)
#define EFM32_USB_HC12_BASE                        (EFM32_USB_BASE+EFM32_USB_HC12_OFFSET)
#define EFM32_USB_HC13_BASE                        (EFM32_USB_BASE+EFM32_USB_HC13_OFFSET)

#define EFM32_USB_HC_CHAR(n)                       (EFM32_USB_HC_BASE(n)+EFM32_USB_HC_CHAR_OFFSET)
#define EFM32_USB_HC_INT(n)                        (EFM32_USB_HC_BASE(n)+EFM32_USB_HC_INT_OFFSET)
#define EFM32_USB_HC_INTMSK(n)                     (EFM32_USB_HC_BASE(n)+EFM32_USB_HC_INTMSK_OFFSET)
#define EFM32_USB_HC_TSIZ(n)                       (EFM32_USB_HC_BASE(n)+EFM32_USB_HC_TSIZ_OFFSET)
#define EFM32_USB_HC_DMAADDR(n)                    (EFM32_USB_HC_BASE(n)+EFM32_USB_HC_DMAADDR_OFFSET)

#define EFM32_USB_DCFG                             (EFM32_USB_BASE+EFM32_USB_DCFG_OFFSET)
#define EFM32_USB_DCTL                             (EFM32_USB_BASE+EFM32_USB_DCTL_OFFSET)
#define EFM32_USB_DSTS                             (EFM32_USB_BASE+EFM32_USB_DSTS_OFFSET)
#define EFM32_USB_DIEPMSK                          (EFM32_USB_BASE+EFM32_USB_DIEPMSK_OFFSET)
#define EFM32_USB_DOEPMSK                          (EFM32_USB_BASE+EFM32_USB_DOEPMSK_OFFSET)
#define EFM32_USB_DAINT                            (EFM32_USB_BASE+EFM32_USB_DAINT_OFFSET)
#define EFM32_USB_DAINTMSK                         (EFM32_USB_BASE+EFM32_USB_DAINTMSK_OFFSET)
#define EFM32_USB_DVBUSDIS                         (EFM32_USB_BASE+EFM32_USB_DVBUSDIS_OFFSET)
#define EFM32_USB_DVBUSPULSE                       (EFM32_USB_BASE+EFM32_USB_DVBUSPULSE_OFFSET)
#define EFM32_USB_DIEPEMPMSK                       (EFM32_USB_BASE+EFM32_USB_DIEPEMPMSK_OFFSET)

