apache/nuttx/arch/arm/src/efm32/hardware/efm32_usb.h
#define EFM32_USB_DIEP_BASE(n)                     (EFM32_USB_BASE+EFM32_USB_DIEP_OFFSET(n))
#define EFM32_USB_DIEP0_BASE                       (EFM32_USB_BASE+EFM32_USB_DIEP0_OFFSET)
#define EFM32_USB_DIEP1_BASE                       (EFM32_USB_BASE+EFM32_USB_DIEP1_OFFSET)
#define EFM32_USB_DIEP2_BASE                       (EFM32_USB_BASE+EFM32_USB_DIEP2_OFFSET)
#define EFM32_USB_DIEP3_BASE                       (EFM32_USB_BASE+EFM32_USB_DIEP3_OFFSET)
#define EFM32_USB_DIEP4_BASE                       (EFM32_USB_BASE+EFM32_USB_DIEP4_OFFSET)
#define EFM32_USB_DIEP5_BASE                       (EFM32_USB_BASE+EFM32_USB_DIEP5_OFFSET)
#define EFM32_USB_DIEP6_BASE                       (EFM32_USB_BASE+EFM32_USB_DIEP6_OFFSET)

#define EFM32_USB_DIEPCTL(n)                       (EFM32_USB_DIEP_BASE(n)+EFM32_USB_DIEPnCTL_OFFSET)
#define EFM32_USB_DIEPINT(n)                       (EFM32_USB_DIEP_BASE(n)+EFM32_USB_DIEPnINT_OFFSET)
#define EFM32_USB_DIEPTSIZ(n)                      (EFM32_USB_DIEP_BASE(n)+EFM32_USB_DIEPnTSIZ_OFFSET)
#define EFM32_USB_DIEPDMAADDR(n)                   (EFM32_USB_DIEP_BASE(n)+EFM32_USB_DIEPnDMAADDR_OFFSET)
#define EFM32_USB_DIEPTXFSTS(n)                    (EFM32_USB_DIEP_BASE(n)+EFM32_USB_DIEPnTXFSTS_OFFSET)

#define EFM32_USB_DIEP0CTL                         (EFM32_USB_BASE+EFM32_USB_DIEP0CTL_OFFSET)
#define EFM32_USB_DIEP0INT                         (EFM32_USB_BASE+EFM32_USB_DIEP0INT_OFFSET)
#define EFM32_USB_DIEP0TSIZ                        (EFM32_USB_BASE+EFM32_USB_DIEP0TSIZ_OFFSET)
#define EFM32_USB_DIEP0DMAADDR                     (EFM32_USB_BASE+EFM32_USB_DIEP0DMAADDR_OFFSET)
#define EFM32_USB_DIEP0TXFSTS                      (EFM32_USB_BASE+EFM32_USB_DIEP0TXFSTS_OFFSET)

#define EFM32_USB_DIEP1CTL                         (EFM32_USB_BASE+EFM32_USB_DIEP1CTL_OFFSET)
#define EFM32_USB_DIEP1INT                         (EFM32_USB_BASE+EFM32_USB_DIEP1INT_OFFSET)
#define EFM32_USB_DIEP1TSIZ                        (EFM32_USB_BASE+EFM32_USB_DIEP1TSIZ_OFFSET)
#define EFM32_USB_DIEP1DMAADDR                     (EFM32_USB_BASE+EFM32_USB_DIEP1DMAADDR_OFFSET)
#define EFM32_USB_DIEP1TXFSTS                      (EFM32_USB_BASE+EFM32_USB_DIEP1TXFSTS_OFFSET)

#define EFM32_USB_DIEP2CTL                         (EFM32_USB_BASE+EFM32_USB_DIEP2CTL_OFFSET)
#define EFM32_USB_DIEP2INT                         (EFM32_USB_BASE+EFM32_USB_DIEP2INT_OFFSET)
#define EFM32_USB_DIEP2TSIZ                        (EFM32_USB_BASE+EFM32_USB_DIEP2TSIZ_OFFSET)
#define EFM32_USB_DIEP2DMAADDR                     (EFM32_USB_BASE+EFM32_USB_DIEP2DMAADDR_OFFSET)
#define EFM32_USB_DIEP2TXFSTS                      (EFM32_USB_BASE+EFM32_USB_DIEP2TXFSTS_OFFSET)

#define EFM32_USB_DIEP3CTL                         (EFM32_USB_BASE+EFM32_USB_DIEP3CTL_OFFSET)
#define EFM32_USB_DIEP3INT                         (EFM32_USB_BASE+EFM32_USB_DIEP3INT_OFFSET)
#define EFM32_USB_DIEP3TSIZ                        (EFM32_USB_BASE+EFM32_USB_DIEP3TSIZ_OFFSET)
#define EFM32_USB_DIEP3DMAADDR                     (EFM32_USB_BASE+EFM32_USB_DIEP3DMAADDR_OFFSET)
#define EFM32_USB_DIEP3_TXFSTS                     (EFM32_USB_BASE+EFM32_USB_DIEP3TXFSTS_OFFSET)

#define EFM32_USB_DIEP4CTL                         (EFM32_USB_BASE+EFM32_USB_DIEP4CTL_OFFSET)
#define EFM32_USB_DIEP4INT                         (EFM32_USB_BASE+EFM32_USB_DIEP4INT_OFFSET)
#define EFM32_USB_DIEP4TSIZ                        (EFM32_USB_BASE+EFM32_USB_DIEP4TSIZ_OFFSET)
#define EFM32_USB_DIEP4DMAADDR                     (EFM32_USB_BASE+EFM32_USB_DIEP4DMAADDR_OFFSET)
#define EFM32_USB_DIEP4TXFSTS                      (EFM32_USB_BASE+EFM32_USB_DIEP4TXFSTS_OFFSET)

#define EFM32_USB_DIEP5CTL                         (EFM32_USB_BASE+EFM32_USB_DIEP5CTL_OFFSET)
#define EFM32_USB_DIEP5INT                         (EFM32_USB_BASE+EFM32_USB_DIEP5INT_OFFSET)
#define EFM32_USB_DIEP5TSIZ                        (EFM32_USB_BASE+EFM32_USB_DIEP5TSIZ_OFFSET)
#define EFM32_USB_DIEP5DMAADDR                     (EFM32_USB_BASE+EFM32_USB_DIEP5DMAADDR_OFFSET)
#define EFM32_USB_DIEP5_TXFSTS                     (EFM32_USB_BASE+EFM32_USB_DIEP5TXFSTS_OFFSET)

#define EFM32_USB_DIEP6CTL                         (EFM32_USB_BASE+EFM32_USB_DIEP6_CTL_OFFSET)
#define EFM32_USB_DIEP6INT                         (EFM32_USB_BASE+EFM32_USB_DIEP6_INT_OFFSET)
#define EFM32_USB_DIEP6TSIZ                        (EFM32_USB_BASE+EFM32_USB_DIEP6_TSIZ_OFFSET)
#define EFM32_USB_DIEP6DMAADDR                     (EFM32_USB_BASE+EFM32_USB_DIEP6_DMAADDR_OFFSET)
#define EFM32_USB_DIEP6TXFSTS                      (EFM32_USB_BASE+EFM32_USB_DIEP6_TXFSTS_OFFSET)

#define EFM32_USB_DOEP_BASE(n)                     (EFM32_USB_BASE+EFM32_USB_DOEP_OFFSET(n))
#define EFM32_USB_DOEP0_BASE                       (EFM32_USB_BASE+EFM32_USB_DOEP0_OFFSET)
#define EFM32_USB_DOEP1_BASE                       (EFM32_USB_BASE+EFM32_USB_DOEP1_OFFSET)
#define EFM32_USB_DOEP2_BASE                       (EFM32_USB_BASE+EFM32_USB_DOEP2_OFFSET)
#define EFM32_USB_DOEP3_BASE                       (EFM32_USB_BASE+EFM32_USB_DOEP3_OFFSET)
#define EFM32_USB_DOEP4_BASE                       (EFM32_USB_BASE+EFM32_USB_DOEP4_OFFSET)
#define EFM32_USB_DOEP5_BASE                       (EFM32_USB_BASE+EFM32_USB_DOEP5_OFFSET)
#define EFM32_USB_DOEP6_BASE                       (EFM32_USB_BASE+EFM32_USB_DOEP6_OFFSET)

#define EFM32_USB_DOEPCTL(n)                       (EFM32_USB_DOEP_BASE(n)+EFM32_USB_DOEPnCTL_OFFSET)
#define EFM32_USB_DOEPINT(n)                       (EFM32_USB_DOEP_BASE(n)+EFM32_USB_DOEPnINT_OFFSET)
#define EFM32_USB_DOEPTSIZ(n)                      (EFM32_USB_DOEP_BASE(n)+EFM32_USB_DOEPnTSIZ_OFFSET)
#define EFM32_USB_DOEPDMAADDR(n)                   (EFM32_USB_DOEP_BASE(n)+EFM32_USB_DOEPnDMAADDR_OFFSET)

#define EFM32_USB_DOEP0CTL                         (EFM32_USB_BASE+EFM32_USB_DOEP0CTL_OFFSET)
#define EFM32_USB_DOEP0INT                         (EFM32_USB_BASE+EFM32_USB_DOEP0INT_OFFSET)
#define EFM32_USB_DOEP0TSIZ                        (EFM32_USB_BASE+EFM32_USB_DOEP0TSIZ_OFFSET)
#define EFM32_USB_DOEP0DMAADDR                     (EFM32_USB_BASE+EFM32_USB_DOEP0DMAADDR_OFFSET)

#define EFM32_USB_DOEP1CTL                         (EFM32_USB_BASE+EFM32_USB_DOEP1CTL_OFFSET)
#define EFM32_USB_DOEP1INT                         (EFM32_USB_BASE+EFM32_USB_DOEP1INT_OFFSET)
#define EFM32_USB_DOEP1TSIZ                        (EFM32_USB_BASE+EFM32_USB_DOEP1TSIZ_OFFSET)
#define EFM32_USB_DOEP1DMAADDR                     (EFM32_USB_BASE+EFM32_USB_DOEP1DMAADDR_OFFSET)

