apache/nuttx/arch/arm/src/efm32/hardware/efm32_usb.h
#define EFM32_USB_DOEP2CTL                         (EFM32_USB_BASE+EFM32_USB_DOEP2CTL_OFFSET)
#define EFM32_USB_DOEP2INT                         (EFM32_USB_BASE+EFM32_USB_DOEP2INT_OFFSET)
#define EFM32_USB_DOEP2TSIZ                        (EFM32_USB_BASE+EFM32_USB_DOEP2TSIZ_OFFSET)
#define EFM32_USB_DOEP2DMAADDR                     (EFM32_USB_BASE+EFM32_USB_DOEP2DMAADDR_OFFSET)

#define EFM32_USB_DOEP3CTL                         (EFM32_USB_BASE+EFM32_USB_DOEP3CTL_OFFSET)
#define EFM32_USB_DOEP3INT                         (EFM32_USB_BASE+EFM32_USB_DOEP3INT_OFFSET)
#define EFM32_USB_DOEP3TSIZ                        (EFM32_USB_BASE+EFM32_USB_DOEP3TSIZ_OFFSET)
#define EFM32_USB_DOEP3DMAADDR                     (EFM32_USB_BASE+EFM32_USB_DOEP3DMAADDR_OFFSET)

#define EFM32_USB_DOEP4CTL                         (EFM32_USB_BASE+EFM32_USB_DOEP4CTL_OFFSET)
#define EFM32_USB_DOEP4INT                         (EFM32_USB_BASE+EFM32_USB_DOEP4INT_OFFSET)
#define EFM32_USB_DOEP4TSIZ                        (EFM32_USB_BASE+EFM32_USB_DOEP4TSIZ_OFFSET)
#define EFM32_USB_DOEP4DMAADDR                     (EFM32_USB_BASE+EFM32_USB_DOEP4DMAADDR_OFFSET)

#define EFM32_USB_DOEP5CTL                         (EFM32_USB_BASE+EFM32_USB_DOEP5CTL_OFFSET)
#define EFM32_USB_DOEP5INT                         (EFM32_USB_BASE+EFM32_USB_DOEP5INT_OFFSET)
#define EFM32_USB_DOEP5TSIZ                        (EFM32_USB_BASE+EFM32_USB_DOEP5TSIZ_OFFSET)
#define EFM32_USB_DOEP5DMAADDR                     (EFM32_USB_BASE+EFM32_USB_DOEP5DMAADDR_OFFSET)

#define EFM32_USB_DOEP6CTL                         (EFM32_USB_BASE+EFM32_USB_DOEP6CTL_OFFSET)
#define EFM32_USB_DOEP6INT                         (EFM32_USB_BASE+EFM32_USB_DOEP6INT_OFFSET)
#define EFM32_USB_DOEP6TSIZ                        (EFM32_USB_BASE+EFM32_USB_DOEP6TSIZ_OFFSET)
#define EFM32_USB_DOEP6DMAADDR                     (EFM32_USB_BASE+EFM32_USB_DOEP6DMAADDR_OFFSET)

#define EFM32_USB_PCGCCTL                          (EFM32_USB_BASE+EFM32_USB_PCGCCTL_OFFSET)

/* Device EP/Host Channel FIFOs */

#define EFM32_USB_FIFO_BASE(n)                     (EFM32_USB_BASE+EFM32_USB_FIFO_OFFSET(n))
#define EFM32_USB_FIFO0_BASE                       (EFM32_USB_BASE+EFM32_USB_FIFO0_OFFSET)
#define EFM32_USB_FIFO1_BASE                       (EFM32_USB_BASE+EFM32_USB_FIFO1_OFFSET)
#define EFM32_USB_FIFO2_BASE                       (EFM32_USB_BASE+EFM32_USB_FIFO2_OFFSET)
#define EFM32_USB_FIFO3_BASE                       (EFM32_USB_BASE+EFM32_USB_FIFO3_OFFSET)
#define EFM32_USB_FIFO4_BASE                       (EFM32_USB_BASE+EFM32_USB_FIFO4_OFFSET)
#define EFM32_USB_FIFO5_BASE                       (EFM32_USB_BASE+EFM32_USB_FIFO5_OFFSET)
#define EFM32_USB_FIFO6_BASE                       (EFM32_USB_BASE+EFM32_USB_FIFO6_OFFSET)
#define EFM32_USB_FIFO7_BASE                       (EFM32_USB_BASE+EFM32_USB_FIFO7_OFFSET)
#define EFM32_USB_FIFO8_BASE                       (EFM32_USB_BASE+EFM32_USB_FIFO8_OFFSET)
#define EFM32_USB_FIFO9_BASE                       (EFM32_USB_BASE+EFM32_USB_FIFO9_OFFSET)
#define EFM32_USB_FIFO10_BASE                      (EFM32_USB_BASE+EFM32_USB_FIFO10_OFFSET)
#define EFM32_USB_FIFO11_BASE                      (EFM32_USB_BASE+EFM32_USB_FIFO11_OFFSET)
#define EFM32_USB_FIFO12_BASE                      (EFM32_USB_BASE+EFM32_USB_FIFO12_OFFSET)
#define EFM32_USB_FIFO13_BASE                      (EFM32_USB_BASE+EFM32_USB_FIFO13_OFFSET)

#define EFM32_USB_FIFOD(n,d)                       (EFM32_USB_BASE+EFM32_USB_FIFOD_OFFSET(n,d))
#define EFM32_FIFORAM(d)                           (EFM32_USB_BASE+EFM32_FIFORAM_OFFSET(d))

/* USB Register Bit Field Definitions ***************************************/

/* Bit fields for USB CTRL */

#define _USB_CTRL_RESETVALUE                       0x00000000UL                           /* Default value for USB_CTRL */
#define _USB_CTRL_MASK                             0x03330003UL                           /* Mask for USB_CTRL */

#define USB_CTRL_VBUSENAP                          (0x1UL << 0)                           /* VBUSEN Active Polarity */
#define _USB_CTRL_VBUSENAP_SHIFT                   0                                      /* Shift value for USB_VBUSENAP */
#define _USB_CTRL_VBUSENAP_MASK                    0x1UL                                  /* Bit mask for USB_VBUSENAP */
#define _USB_CTRL_VBUSENAP_DEFAULT                 0x00000000UL                           /* Mode DEFAULT for USB_CTRL */
#define _USB_CTRL_VBUSENAP_LOW                     0x00000000UL                           /* Mode LOW for USB_CTRL */
#define _USB_CTRL_VBUSENAP_HIGH                    0x00000001UL                           /* Mode HIGH for USB_CTRL */
#define USB_CTRL_VBUSENAP_DEFAULT                  (_USB_CTRL_VBUSENAP_DEFAULT << 0)      /* Shifted mode DEFAULT for USB_CTRL */
#define USB_CTRL_VBUSENAP_LOW                      (_USB_CTRL_VBUSENAP_LOW << 0)          /* Shifted mode LOW for USB_CTRL */
#define USB_CTRL_VBUSENAP_HIGH                     (_USB_CTRL_VBUSENAP_HIGH << 0)         /* Shifted mode HIGH for USB_CTRL */
#define USB_CTRL_DMPUAP                            (0x1UL << 1)                           /* DMPU Active Polarity */
#define _USB_CTRL_DMPUAP_SHIFT                     1                                      /* Shift value for USB_DMPUAP */
#define _USB_CTRL_DMPUAP_MASK                      0x2UL                                  /* Bit mask for USB_DMPUAP */
#define _USB_CTRL_DMPUAP_DEFAULT                   0x00000000UL                           /* Mode DEFAULT for USB_CTRL */
#define _USB_CTRL_DMPUAP_LOW                       0x00000000UL                           /* Mode LOW for USB_CTRL */
#define _USB_CTRL_DMPUAP_HIGH                      0x00000001UL                           /* Mode HIGH for USB_CTRL */
#define USB_CTRL_DMPUAP_DEFAULT                    (_USB_CTRL_DMPUAP_DEFAULT << 1)        /* Shifted mode DEFAULT for USB_CTRL */
#define USB_CTRL_DMPUAP_LOW                        (_USB_CTRL_DMPUAP_LOW << 1)            /* Shifted mode LOW for USB_CTRL */
#define USB_CTRL_DMPUAP_HIGH                       (_USB_CTRL_DMPUAP_HIGH << 1)           /* Shifted mode HIGH for USB_CTRL */
#define USB_CTRL_VREGDIS                           (0x1UL << 16)                          /* Voltage Regulator Disable */
#define _USB_CTRL_VREGDIS_SHIFT                    16                                     /* Shift value for USB_VREGDIS */
#define _USB_CTRL_VREGDIS_MASK                     0x10000UL                              /* Bit mask for USB_VREGDIS */
#define _USB_CTRL_VREGDIS_DEFAULT                  0x00000000UL                           /* Mode DEFAULT for USB_CTRL */
#define USB_CTRL_VREGDIS_DEFAULT                   (_USB_CTRL_VREGDIS_DEFAULT << 16)      /* Shifted mode DEFAULT for USB_CTRL */
#define USB_CTRL_VREGOSEN                          (0x1UL << 17)                          /* VREGO Sense Enable */
#define _USB_CTRL_VREGOSEN_SHIFT                   17                                     /* Shift value for USB_VREGOSEN */
#define _USB_CTRL_VREGOSEN_MASK                    0x20000UL                              /* Bit mask for USB_VREGOSEN */
#define _USB_CTRL_VREGOSEN_DEFAULT                 0x00000000UL                           /* Mode DEFAULT for USB_CTRL */
#define USB_CTRL_VREGOSEN_DEFAULT                  (_USB_CTRL_VREGOSEN_DEFAULT << 17)     /* Shifted mode DEFAULT for USB_CTRL */
#define _USB_CTRL_BIASPROGEM01_SHIFT               20                                     /* Shift value for USB_BIASPROGEM01 */
#define _USB_CTRL_BIASPROGEM01_MASK                0x300000UL                             /* Bit mask for USB_BIASPROGEM01 */
#define _USB_CTRL_BIASPROGEM01_DEFAULT             0x00000000UL                           /* Mode DEFAULT for USB_CTRL */
#define USB_CTRL_BIASPROGEM01_DEFAULT              (_USB_CTRL_BIASPROGEM01_DEFAULT << 20) /* Shifted mode DEFAULT for USB_CTRL */
#define _USB_CTRL_BIASPROGEM23_SHIFT               24                                     /* Shift value for USB_BIASPROGEM23 */
#define _USB_CTRL_BIASPROGEM23_MASK                0x3000000UL                            /* Bit mask for USB_BIASPROGEM23 */
#define _USB_CTRL_BIASPROGEM23_DEFAULT             0x00000000UL                           /* Mode DEFAULT for USB_CTRL */
#define USB_CTRL_BIASPROGEM23_DEFAULT              (_USB_CTRL_BIASPROGEM23_DEFAULT << 24) /* Shifted mode DEFAULT for USB_CTRL */

/* Bit fields for USB STATUS */

