apache/nuttx/arch/arm/src/efm32/hardware/efm32_usb.h
#define _USB_DIEP0TSIZ_RESETVALUE                  0x00000000UL                           /* Default value for USB_DIEP0TSIZ */
#define _USB_DIEP0TSIZ_MASK                        0x0018007FUL                           /* Mask for USB_DIEP0TSIZ */

#define _USB_DIEP0TSIZ_XFERSIZE_SHIFT              0                                      /* Shift value for USB_XFERSIZE */
#define _USB_DIEP0TSIZ_XFERSIZE_MASK               0x7FUL                                 /* Bit mask for USB_XFERSIZE */
#define _USB_DIEP0TSIZ_XFERSIZE_DEFAULT            0x00000000UL                           /* Mode DEFAULT for USB_DIEP0TSIZ */
#define USB_DIEP0TSIZ_XFERSIZE_DEFAULT             (_USB_DIEP0TSIZ_XFERSIZE_DEFAULT << 0) /* Shifted mode DEFAULT for USB_DIEP0TSIZ */
#define _USB_DIEP0TSIZ_PKTCNT_SHIFT                19                                     /* Shift value for USB_PKTCNT */
#define _USB_DIEP0TSIZ_PKTCNT_MASK                 0x180000UL                             /* Bit mask for USB_PKTCNT */
#define _USB_DIEP0TSIZ_PKTCNT_DEFAULT              0x00000000UL                           /* Mode DEFAULT for USB_DIEP0TSIZ */
#define USB_DIEP0TSIZ_PKTCNT_DEFAULT               (_USB_DIEP0TSIZ_PKTCNT_DEFAULT << 19)  /* Shifted mode DEFAULT for USB_DIEP0TSIZ */

/* Bit fields for USB DIEP0DMAADDR */

#define _USB_DIEP0DMAADDR_RESETVALUE               0x00000000UL                                  /* Default value for USB_DIEP0DMAADDR */
#define _USB_DIEP0DMAADDR_MASK                     0xFFFFFFFFUL                                  /* Mask for USB_DIEP0DMAADDR */

#define _USB_DIEP0DMAADDR_DIEP0DMAADDR_SHIFT       0                                             /* Shift value for USB_DIEP0DMAADDR */
#define _USB_DIEP0DMAADDR_DIEP0DMAADDR_MASK        0xFFFFFFFFUL                                  /* Bit mask for USB_DIEP0DMAADDR */
#define _USB_DIEP0DMAADDR_DIEP0DMAADDR_DEFAULT     0x00000000UL                                  /* Mode DEFAULT for USB_DIEP0DMAADDR */
#define USB_DIEP0DMAADDR_DIEP0DMAADDR_DEFAULT      (_USB_DIEP0DMAADDR_DIEP0DMAADDR_DEFAULT << 0) /* Shifted mode DEFAULT for USB_DIEP0DMAADDR */

/* Bit fields for USB DIEP0TXFSTS */

#define _USB_DIEP0TXFSTS_RESETVALUE                0x00000200UL                             /* Default value for USB_DIEP0TXFSTS */
#define _USB_DIEP0TXFSTS_MASK                      0x0000FFFFUL                             /* Mask for USB_DIEP0TXFSTS */

#define _USB_DIEP0TXFSTS_SPCAVAIL_SHIFT            0                                        /* Shift value for USB_SPCAVAIL */
#define _USB_DIEP0TXFSTS_SPCAVAIL_MASK             0xFFFFUL                                 /* Bit mask for USB_SPCAVAIL */
#define _USB_DIEP0TXFSTS_SPCAVAIL_DEFAULT          0x00000200UL                             /* Mode DEFAULT for USB_DIEP0TXFSTS */
#define USB_DIEP0TXFSTS_SPCAVAIL_DEFAULT           (_USB_DIEP0TXFSTS_SPCAVAIL_DEFAULT << 0) /* Shifted mode DEFAULT for USB_DIEP0TXFSTS */

/* Bit fields for USB DIEPCTL */

#define _USB_DIEPCTL_RESETVALUE                    0x00000000UL                            /* Default value for USB_DIEPCTL */
#define _USB_DIEPCTL_MASK                          0xFFEF87FFUL                            /* Mask for USB_DIEPCTL */

#define _USB_DIEPCTL_MPS_SHIFT                     0                                       /* Shift value for USB_MPS */
#define _USB_DIEPCTL_MPS_MASK                      0x7FFUL                                 /* Bit mask for USB_MPS */
#define _USB_DIEPCTL_MPS_DEFAULT                   0x00000000UL                            /* Mode DEFAULT for USB_DIEPCTL */
#define USB_DIEPCTL_MPS_DEFAULT                    (_USB_DIEPCTL_MPS_DEFAULT << 0)         /* Shifted mode DEFAULT for USB_DIEPCTL */
#define USB_DIEPCTL_USBACTEP                       (0x1UL << 15)                           /* USB Active Endpoint */
#define _USB_DIEPCTL_USBACTEP_SHIFT                15                                      /* Shift value for USB_USBACTEP */
#define _USB_DIEPCTL_USBACTEP_MASK                 0x8000UL                                /* Bit mask for USB_USBACTEP */
#define _USB_DIEPCTL_USBACTEP_DEFAULT              0x00000000UL                            /* Mode DEFAULT for USB_DIEPCTL */
#define USB_DIEPCTL_USBACTEP_DEFAULT               (_USB_DIEPCTL_USBACTEP_DEFAULT << 15)   /* Shifted mode DEFAULT for USB_DIEPCTL */
#define USB_DIEPCTL_DPIDEOF                        (0x1UL << 16)                           /* Endpoint Data PID / Even or Odd Frame */
#define _USB_DIEPCTL_DPIDEOF_SHIFT                 16                                      /* Shift value for USB_DPIDEOF */
#define _USB_DIEPCTL_DPIDEOF_MASK                  0x10000UL                               /* Bit mask for USB_DPIDEOF */
#define _USB_DIEPCTL_DPIDEOF_DEFAULT               0x00000000UL                            /* Mode DEFAULT for USB_DIEPCTL */
#define _USB_DIEPCTL_DPIDEOF_DATA0EVEN             0x00000000UL                            /* Mode DATA0EVEN for USB_DIEPCTL */
#define _USB_DIEPCTL_DPIDEOF_DATA1ODD              0x00000001UL                            /* Mode DATA1ODD for USB_DIEPCTL */
#define USB_DIEPCTL_DPIDEOF_DEFAULT                (_USB_DIEPCTL_DPIDEOF_DEFAULT << 16)    /* Shifted mode DEFAULT for USB_DIEPCTL */
#define USB_DIEPCTL_DPIDEOF_DATA0EVEN              (_USB_DIEPCTL_DPIDEOF_DATA0EVEN << 16)  /* Shifted mode DATA0EVEN for USB_DIEPCTL */
#define USB_DIEPCTL_DPIDEOF_DATA1ODD               (_USB_DIEPCTL_DPIDEOF_DATA1ODD << 16)   /* Shifted mode DATA1ODD for USB_DIEPCTL */
#define USB_DIEPCTL_NAKSTS                         (0x1UL << 17)                           /* NAK Status */
#define _USB_DIEPCTL_NAKSTS_SHIFT                  17                                      /* Shift value for USB_NAKSTS */
#define _USB_DIEPCTL_NAKSTS_MASK                   0x20000UL                               /* Bit mask for USB_NAKSTS */
#define _USB_DIEPCTL_NAKSTS_DEFAULT                0x00000000UL                            /* Mode DEFAULT for USB_DIEPCTL */
#define USB_DIEPCTL_NAKSTS_DEFAULT                 (_USB_DIEPCTL_NAKSTS_DEFAULT << 17)     /* Shifted mode DEFAULT for USB_DIEPCTL */
#define _USB_DIEPCTL_EPTYPE_SHIFT                  18                                      /* Shift value for USB_EPTYPE */
#define _USB_DIEPCTL_EPTYPE_MASK                   0xC0000UL                               /* Bit mask for USB_EPTYPE */
#define _USB_DIEPCTL_EPTYPE_DEFAULT                0x00000000UL                            /* Mode DEFAULT for USB_DIEPCTL */
#define _USB_DIEPCTL_EPTYPE_CONTROL                0x00000000UL                            /* Mode CONTROL for USB_DIEPCTL */
#define _USB_DIEPCTL_EPTYPE_ISO                    0x00000001UL                            /* Mode ISO for USB_DIEPCTL */
#define _USB_DIEPCTL_EPTYPE_BULK                   0x00000002UL                            /* Mode BULK for USB_DIEPCTL */
#define _USB_DIEPCTL_EPTYPE_INT                    0x00000003UL                            /* Mode INT for USB_DIEPCTL */
#define USB_DIEPCTL_EPTYPE_DEFAULT                 (_USB_DIEPCTL_EPTYPE_DEFAULT << 18)     /* Shifted mode DEFAULT for USB_DIEPCTL */
#define USB_DIEPCTL_EPTYPE_CONTROL                 (_USB_DIEPCTL_EPTYPE_CONTROL << 18)     /* Shifted mode CONTROL for USB_DIEPCTL */
#define USB_DIEPCTL_EPTYPE_ISO                     (_USB_DIEPCTL_EPTYPE_ISO << 18)         /* Shifted mode ISO for USB_DIEPCTL */
#define USB_DIEPCTL_EPTYPE_BULK                    (_USB_DIEPCTL_EPTYPE_BULK << 18)        /* Shifted mode BULK for USB_DIEPCTL */
#define USB_DIEPCTL_EPTYPE_INT                     (_USB_DIEPCTL_EPTYPE_INT << 18)         /* Shifted mode INT for USB_DIEPCTL */
#define USB_DIEPCTL_STALL                          (0x1UL << 21)                           /* Handshake */
#define _USB_DIEPCTL_STALL_SHIFT                   21                                      /* Shift value for USB_STALL */
#define _USB_DIEPCTL_STALL_MASK                    0x200000UL                              /* Bit mask for USB_STALL */
#define _USB_DIEPCTL_STALL_DEFAULT                 0x00000000UL                            /* Mode DEFAULT for USB_DIEPCTL */
#define USB_DIEPCTL_STALL_DEFAULT                  (_USB_DIEPCTL_STALL_DEFAULT << 21)      /* Shifted mode DEFAULT for USB_DIEPCTL */
#define _USB_DIEPCTL_TXFNUM_SHIFT                  22                                      /* Shift value for USB_TXFNUM */
#define _USB_DIEPCTL_TXFNUM_MASK                   0x3c00000UL                             /* Bit mask for USB_TXFNUM */
#define _USB_DIEPCTL_TXFNUM_DEFAULT                0x00000000UL                            /* Mode DEFAULT for USB_DIEPCTL */
#define USB_DIEPCTL_TXFNUM_DEFAULT                 (_USB_DIEPCTL_TXFNUM_DEFAULT << 22)     /* Shifted mode DEFAULT for USB_DIEPCTL */
#define USB_DIEPCTL_CNAK                           (0x1UL << 26)                           /* Clear NAK */
#define _USB_DIEPCTL_CNAK_SHIFT                    26                                      /* Shift value for USB_CNAK */
#define _USB_DIEPCTL_CNAK_MASK                     0x4000000UL                             /* Bit mask for USB_CNAK */
#define _USB_DIEPCTL_CNAK_DEFAULT                  0x00000000UL                            /* Mode DEFAULT for USB_DIEPCTL */
#define USB_DIEPCTL_CNAK_DEFAULT                   (_USB_DIEPCTL_CNAK_DEFAULT << 26)       /* Shifted mode DEFAULT for USB_DIEPCTL */
#define USB_DIEPCTL_SNAK                           (0x1UL << 27)                           /* Set NAK */
#define _USB_DIEPCTL_SNAK_SHIFT                    27                                      /* Shift value for USB_SNAK */
#define _USB_DIEPCTL_SNAK_MASK                     0x8000000UL                             /* Bit mask for USB_SNAK */
#define _USB_DIEPCTL_SNAK_DEFAULT                  0x00000000UL                            /* Mode DEFAULT for USB_DIEPCTL */
#define USB_DIEPCTL_SNAK_DEFAULT                   (_USB_DIEPCTL_SNAK_DEFAULT << 27)       /* Shifted mode DEFAULT for USB_DIEPCTL */
#define USB_DIEPCTL_SETD0PIDEF                     (0x1UL << 28)                           /* Set DATA0 PID / Even Frame */
#define _USB_DIEPCTL_SETD0PIDEF_SHIFT              28                                      /* Shift value for USB_SETD0PIDEF */
#define _USB_DIEPCTL_SETD0PIDEF_MASK               0x10000000UL                            /* Bit mask for USB_SETD0PIDEF */
#define _USB_DIEPCTL_SETD0PIDEF_DEFAULT            0x00000000UL                            /* Mode DEFAULT for USB_DIEPCTL */
#define USB_DIEPCTL_SETD0PIDEF_DEFAULT             (_USB_DIEPCTL_SETD0PIDEF_DEFAULT << 28) /* Shifted mode DEFAULT for USB_DIEPCTL */
#define USB_DIEPCTL_SETD1PIDOF                     (0x1UL << 29)                           /* Set DATA1 PID / Odd Frame */
#define _USB_DIEPCTL_SETD1PIDOF_SHIFT              29                                      /* Shift value for USB_SETD1PIDOF */
#define _USB_DIEPCTL_SETD1PIDOF_MASK               0x20000000UL                            /* Bit mask for USB_SETD1PIDOF */
#define _USB_DIEPCTL_SETD1PIDOF_DEFAULT            0x00000000UL                            /* Mode DEFAULT for USB_DIEPCTL */
#define USB_DIEPCTL_SETD1PIDOF_DEFAULT             (_USB_DIEPCTL_SETD1PIDOF_DEFAULT << 29) /* Shifted mode DEFAULT for USB_DIEPCTL */
#define USB_DIEPCTL_EPDIS                          (0x1UL << 30)                           /* Endpoint Disable */
#define _USB_DIEPCTL_EPDIS_SHIFT                   30                                      /* Shift value for USB_EPDIS */
#define _USB_DIEPCTL_EPDIS_MASK                    0x40000000UL                            /* Bit mask for USB_EPDIS */
#define _USB_DIEPCTL_EPDIS_DEFAULT                 0x00000000UL                            /* Mode DEFAULT for USB_DIEPCTL */
#define USB_DIEPCTL_EPDIS_DEFAULT                  (_USB_DIEPCTL_EPDIS_DEFAULT << 30)      /* Shifted mode DEFAULT for USB_DIEPCTL */
#define USB_DIEPCTL_EPENA                          (0x1UL << 31)                           /* Endpoint Enable */
#define _USB_DIEPCTL_EPENA_SHIFT                   31                                      /* Shift value for USB_EPENA */
#define _USB_DIEPCTL_EPENA_MASK                    0x80000000UL                            /* Bit mask for USB_EPENA */
#define _USB_DIEPCTL_EPENA_DEFAULT                 0x00000000UL                            /* Mode DEFAULT for USB_DIEPCTL */
#define USB_DIEPCTL_EPENA_DEFAULT                  (_USB_DIEPCTL_EPENA_DEFAULT << 31)      /* Shifted mode DEFAULT for USB_DIEPCTL */

/* Bit fields for USB DIEPINT */

#define _USB_DIEPINT_RESETVALUE                    0x00000080UL                            /* Default value for USB_DIEPINT */
#define _USB_DIEPINT_MASK                          0x000038DFUL                            /* Mask for USB_DIEPINT */

#define USB_DIEPINT_XFERCOMPL                      (0x1UL << 0)                            /* Transfer Completed Interrupt */
#define _USB_DIEPINT_XFERCOMPL_SHIFT               0                                       /* Shift value for USB_XFERCOMPL */
#define _USB_DIEPINT_XFERCOMPL_MASK                0x1UL                                   /* Bit mask for USB_XFERCOMPL */
#define _USB_DIEPINT_XFERCOMPL_DEFAULT             0x00000000UL                            /* Mode DEFAULT for USB_DIEPINT */
#define USB_DIEPINT_XFERCOMPL_DEFAULT              (_USB_DIEPINT_XFERCOMPL_DEFAULT << 0)   /* Shifted mode DEFAULT for USB_DIEPINT */
#define USB_DIEPINT_EPDISBLD                       (0x1UL << 1)                            /* Endpoint Disabled Interrupt */
#define _USB_DIEPINT_EPDISBLD_SHIFT                1                                       /* Shift value for USB_EPDISBLD */
#define _USB_DIEPINT_EPDISBLD_MASK                 0x2UL                                   /* Bit mask for USB_EPDISBLD */
#define _USB_DIEPINT_EPDISBLD_DEFAULT              0x00000000UL                            /* Mode DEFAULT for USB_DIEPINT */
#define USB_DIEPINT_EPDISBLD_DEFAULT               (_USB_DIEPINT_EPDISBLD_DEFAULT << 1)    /* Shifted mode DEFAULT for USB_DIEPINT */
#define USB_DIEPINT_AHBERR                         (0x1UL << 2)                            /* AHB Error */
#define _USB_DIEPINT_AHBERR_SHIFT                  2                                       /* Shift value for USB_AHBERR */
#define _USB_DIEPINT_AHBERR_MASK                   0x4UL                                   /* Bit mask for USB_AHBERR */
#define _USB_DIEPINT_AHBERR_DEFAULT                0x00000000UL                            /* Mode DEFAULT for USB_DIEPINT */
#define USB_DIEPINT_AHBERR_DEFAULT                 (_USB_DIEPINT_AHBERR_DEFAULT << 2)      /* Shifted mode DEFAULT for USB_DIEPINT */
#define USB_DIEPINT_TIMEOUT                        (0x1UL << 3)                            /* Timeout Condition */
#define _USB_DIEPINT_TIMEOUT_SHIFT                 3                                       /* Shift value for USB_TIMEOUT */
#define _USB_DIEPINT_TIMEOUT_MASK                  0x8UL                                   /* Bit mask for USB_TIMEOUT */
#define _USB_DIEPINT_TIMEOUT_DEFAULT               0x00000000UL                            /* Mode DEFAULT for USB_DIEPINT */
#define USB_DIEPINT_TIMEOUT_DEFAULT                (_USB_DIEPINT_TIMEOUT_DEFAULT << 3)     /* Shifted mode DEFAULT for USB_DIEPINT */
#define USB_DIEPINT_INTKNTXFEMP                    (0x1UL << 4)                            /* IN Token Received When TxFIFO is Empty */
#define _USB_DIEPINT_INTKNTXFEMP_SHIFT             4                                       /* Shift value for USB_INTKNTXFEMP */
#define _USB_DIEPINT_INTKNTXFEMP_MASK              0x10UL                                  /* Bit mask for USB_INTKNTXFEMP */
#define _USB_DIEPINT_INTKNTXFEMP_DEFAULT           0x00000000UL                            /* Mode DEFAULT for USB_DIEPINT */
#define USB_DIEPINT_INTKNTXFEMP_DEFAULT            (_USB_DIEPINT_INTKNTXFEMP_DEFAULT << 4) /* Shifted mode DEFAULT for USB_DIEPINT */
#define USB_DIEPINT_INEPNAKEFF                     (0x1UL << 6)                            /* IN Endpoint NAK Effective */
#define _USB_DIEPINT_INEPNAKEFF_SHIFT              6                                       /* Shift value for USB_INEPNAKEFF */
#define _USB_DIEPINT_INEPNAKEFF_MASK               0x40UL                                  /* Bit mask for USB_INEPNAKEFF */
#define _USB_DIEPINT_INEPNAKEFF_DEFAULT            0x00000000UL                            /* Mode DEFAULT for USB_DIEPINT */
#define USB_DIEPINT_INEPNAKEFF_DEFAULT             (_USB_DIEPINT_INEPNAKEFF_DEFAULT << 6)  /* Shifted mode DEFAULT for USB_DIEPINT */
#define USB_DIEPINT_TXFEMP                         (0x1UL << 7)                            /* Transmit FIFO Empty */
#define _USB_DIEPINT_TXFEMP_SHIFT                  7                                       /* Shift value for USB_TXFEMP */
#define _USB_DIEPINT_TXFEMP_MASK                   0x80UL                                  /* Bit mask for USB_TXFEMP */
#define _USB_DIEPINT_TXFEMP_DEFAULT                0x00000001UL                            /* Mode DEFAULT for USB_DIEPINT */
#define USB_DIEPINT_TXFEMP_DEFAULT                 (_USB_DIEPINT_TXFEMP_DEFAULT << 7)      /* Shifted mode DEFAULT for USB_DIEPINT */
#define USB_DIEPINT_PKTDRPSTS                      (0x1UL << 11)                           /* Packet Drop Status */
#define _USB_DIEPINT_PKTDRPSTS_SHIFT               11                                      /* Shift value for USB_PKTDRPSTS */
#define _USB_DIEPINT_PKTDRPSTS_MASK                0x800UL                                 /* Bit mask for USB_PKTDRPSTS */
#define _USB_DIEPINT_PKTDRPSTS_DEFAULT             0x00000000UL                            /* Mode DEFAULT for USB_DIEPINT */
#define USB_DIEPINT_PKTDRPSTS_DEFAULT              (_USB_DIEPINT_PKTDRPSTS_DEFAULT << 11)  /* Shifted mode DEFAULT for USB_DIEPINT */
#define USB_DIEPINT_BBLEERR                        (0x1UL << 12)                           /* NAK Interrupt */
#define _USB_DIEPINT_BBLEERR_SHIFT                 12                                      /* Shift value for USB_BBLEERR */
#define _USB_DIEPINT_BBLEERR_MASK                  0x1000UL                                /* Bit mask for USB_BBLEERR */
#define _USB_DIEPINT_BBLEERR_DEFAULT               0x00000000UL                            /* Mode DEFAULT for USB_DIEPINT */
#define USB_DIEPINT_BBLEERR_DEFAULT                (_USB_DIEPINT_BBLEERR_DEFAULT << 12)    /* Shifted mode DEFAULT for USB_DIEPINT */
#define USB_DIEPINT_NAKINTRPT                      (0x1UL << 13)                           /* NAK Interrupt */
#define _USB_DIEPINT_NAKINTRPT_SHIFT               13                                      /* Shift value for USB_NAKINTRPT */
#define _USB_DIEPINT_NAKINTRPT_MASK                0x2000UL                                /* Bit mask for USB_NAKINTRPT */
#define _USB_DIEPINT_NAKINTRPT_DEFAULT             0x00000000UL                            /* Mode DEFAULT for USB_DIEPINT */
#define USB_DIEPINT_NAKINTRPT_DEFAULT              (_USB_DIEPINT_NAKINTRPT_DEFAULT << 13)  /* Shifted mode DEFAULT for USB_DIEPINT */

/* Bit fields for USB DIEPTSIZ */

#define _USB_DIEPTSIZ_RESETVALUE                   0x00000000UL                          /* Default value for USB_DIEPTSIZ */
#define _USB_DIEPTSIZ_MASK                         0x7FFFFFFFUL                          /* Mask for USB_DIEPTSIZ */

#define _USB_DIEPTSIZ_XFERSIZE_SHIFT               0                                     /* Shift value for USB_XFERSIZE */
#define _USB_DIEPTSIZ_XFERSIZE_MASK                0x7FFFFUL                             /* Bit mask for USB_XFERSIZE */
#define _USB_DIEPTSIZ_XFERSIZE_DEFAULT             0x00000000UL                          /* Mode DEFAULT for USB_DIEPTSIZ */
#define USB_DIEPTSIZ_XFERSIZE_DEFAULT              (_USB_DIEPTSIZ_XFERSIZE_DEFAULT << 0) /* Shifted mode DEFAULT for USB_DIEPTSIZ */
#define _USB_DIEPTSIZ_PKTCNT_SHIFT                 19                                    /* Shift value for USB_PKTCNT */
#define _USB_DIEPTSIZ_PKTCNT_MASK                  0x1FF80000UL                          /* Bit mask for USB_PKTCNT */
#define _USB_DIEPTSIZ_PKTCNT_DEFAULT               0x00000000UL                          /* Mode DEFAULT for USB_DIEPTSIZ */
#define USB_DIEPTSIZ_PKTCNT_DEFAULT                (_USB_DIEPTSIZ_PKTCNT_DEFAULT << 19)  /* Shifted mode DEFAULT for USB_DIEPTSIZ */
#define _USB_DIEPTSIZ_MC_SHIFT                     29                                    /* Shift value for USB_MC */
#define _USB_DIEPTSIZ_MC_MASK                      0x60000000UL                          /* Bit mask for USB_MC */
#define _USB_DIEPTSIZ_MC_DEFAULT                   0x00000000UL                          /* Mode DEFAULT for USB_DIEPTSIZ */
#define USB_DIEPTSIZ_MC_DEFAULT                    (_USB_DIEPTSIZ_MC_DEFAULT << 29)      /* Shifted mode DEFAULT for USB_DIEPTSIZ */

/* Bit fields for USB DIEPDMAADDR */

