apache/nuttx/arch/arm/src/efm32/hardware/efm32_usb.h
#define _USB_DOEP0DMAADDR_DOEP0DMAADDR_SHIFT       0                                             /* Shift value for USB_DOEP0DMAADDR */
#define _USB_DOEP0DMAADDR_DOEP0DMAADDR_MASK        0xFFFFFFFFUL                                  /* Bit mask for USB_DOEP0DMAADDR */
#define _USB_DOEP0DMAADDR_DOEP0DMAADDR_DEFAULT     0x00000000UL                                  /* Mode DEFAULT for USB_DOEP0DMAADDR */
#define USB_DOEP0DMAADDR_DOEP0DMAADDR_DEFAULT      (_USB_DOEP0DMAADDR_DOEP0DMAADDR_DEFAULT << 0) /* Shifted mode DEFAULT for USB_DOEP0DMAADDR */

/* Bit fields for USB DOEPCTL */

#define _USB_DOEPCTL_RESETVALUE                    0x00000000UL                            /* Default value for USB_DOEPCTL */
#define _USB_DOEPCTL_MASK                          0xFC3F87FFUL                            /* Mask for USB_DOEPCTL */

#define _USB_DOEPCTL_MPS_SHIFT                     0                                       /* Shift value for USB_MPS */
#define _USB_DOEPCTL_MPS_MASK                      0x7FFUL                                 /* Bit mask for USB_MPS */
#define _USB_DOEPCTL_MPS_DEFAULT                   0x00000000UL                            /* Mode DEFAULT for USB_DOEPCTL */
#define USB_DOEPCTL_MPS_DEFAULT                    (_USB_DOEPCTL_MPS_DEFAULT << 0)         /* Shifted mode DEFAULT for USB_DOEPCTL */
#define USB_DOEPCTL_USBACTEP                       (0x1UL << 15)                           /* USB Active Endpoint */
#define _USB_DOEPCTL_USBACTEP_SHIFT                15                                      /* Shift value for USB_USBACTEP */
#define _USB_DOEPCTL_USBACTEP_MASK                 0x8000UL                                /* Bit mask for USB_USBACTEP */
#define _USB_DOEPCTL_USBACTEP_DEFAULT              0x00000000UL                            /* Mode DEFAULT for USB_DOEPCTL */
#define USB_DOEPCTL_USBACTEP_DEFAULT               (_USB_DOEPCTL_USBACTEP_DEFAULT << 15)   /* Shifted mode DEFAULT for USB_DOEPCTL */
#define USB_DOEPCTL_DPIDEOF                        (0x1UL << 16)                           /* Endpoint Data PID / Even-odd Frame */
#define _USB_DOEPCTL_DPIDEOF_SHIFT                 16                                      /* Shift value for USB_DPIDEOF */
#define _USB_DOEPCTL_DPIDEOF_MASK                  0x10000UL                               /* Bit mask for USB_DPIDEOF */
#define _USB_DOEPCTL_DPIDEOF_DEFAULT               0x00000000UL                            /* Mode DEFAULT for USB_DOEPCTL */
#define _USB_DOEPCTL_DPIDEOF_DATA0EVEN             0x00000000UL                            /* Mode DATA0EVEN for USB_DOEPCTL */
#define _USB_DOEPCTL_DPIDEOF_DATA1ODD              0x00000001UL                            /* Mode DATA1ODD for USB_DOEPCTL */
#define USB_DOEPCTL_DPIDEOF_DEFAULT                (_USB_DOEPCTL_DPIDEOF_DEFAULT << 16)    /* Shifted mode DEFAULT for USB_DOEPCTL */
#define USB_DOEPCTL_DPIDEOF_DATA0EVEN              (_USB_DOEPCTL_DPIDEOF_DATA0EVEN << 16)  /* Shifted mode DATA0EVEN for USB_DOEPCTL */
#define USB_DOEPCTL_DPIDEOF_DATA1ODD               (_USB_DOEPCTL_DPIDEOF_DATA1ODD << 16)   /* Shifted mode DATA1ODD for USB_DOEPCTL */
#define USB_DOEPCTL_NAKSTS                         (0x1UL << 17)                           /* NAK Status */
#define _USB_DOEPCTL_NAKSTS_SHIFT                  17                                      /* Shift value for USB_NAKSTS */
#define _USB_DOEPCTL_NAKSTS_MASK                   0x20000UL                               /* Bit mask for USB_NAKSTS */
#define _USB_DOEPCTL_NAKSTS_DEFAULT                0x00000000UL                            /* Mode DEFAULT for USB_DOEPCTL */
#define USB_DOEPCTL_NAKSTS_DEFAULT                 (_USB_DOEPCTL_NAKSTS_DEFAULT << 17)     /* Shifted mode DEFAULT for USB_DOEPCTL */
#define _USB_DOEPCTL_EPTYPE_SHIFT                  18                                      /* Shift value for USB_EPTYPE */
#define _USB_DOEPCTL_EPTYPE_MASK                   0xC0000UL                               /* Bit mask for USB_EPTYPE */
#define _USB_DOEPCTL_EPTYPE_DEFAULT                0x00000000UL                            /* Mode DEFAULT for USB_DOEPCTL */
#define _USB_DOEPCTL_EPTYPE_CONTROL                0x00000000UL                            /* Mode CONTROL for USB_DOEPCTL */
#define _USB_DOEPCTL_EPTYPE_ISO                    0x00000001UL                            /* Mode ISO for USB_DOEPCTL */
#define _USB_DOEPCTL_EPTYPE_BULK                   0x00000002UL                            /* Mode BULK for USB_DOEPCTL */
#define _USB_DOEPCTL_EPTYPE_INT                    0x00000003UL                            /* Mode INT for USB_DOEPCTL */
#define USB_DOEPCTL_EPTYPE_DEFAULT                 (_USB_DOEPCTL_EPTYPE_DEFAULT << 18)     /* Shifted mode DEFAULT for USB_DOEPCTL */
#define USB_DOEPCTL_EPTYPE_CONTROL                 (_USB_DOEPCTL_EPTYPE_CONTROL << 18)     /* Shifted mode CONTROL for USB_DOEPCTL */
#define USB_DOEPCTL_EPTYPE_ISO                     (_USB_DOEPCTL_EPTYPE_ISO << 18)         /* Shifted mode ISO for USB_DOEPCTL */
#define USB_DOEPCTL_EPTYPE_BULK                    (_USB_DOEPCTL_EPTYPE_BULK << 18)        /* Shifted mode BULK for USB_DOEPCTL */
#define USB_DOEPCTL_EPTYPE_INT                     (_USB_DOEPCTL_EPTYPE_INT << 18)         /* Shifted mode INT for USB_DOEPCTL */
#define USB_DOEPCTL_SNP                            (0x1UL << 20)                           /* Snoop Mode */
#define _USB_DOEPCTL_SNP_SHIFT                     20                                      /* Shift value for USB_SNP */
#define _USB_DOEPCTL_SNP_MASK                      0x100000UL                              /* Bit mask for USB_SNP */
#define _USB_DOEPCTL_SNP_DEFAULT                   0x00000000UL                            /* Mode DEFAULT for USB_DOEPCTL */
#define USB_DOEPCTL_SNP_DEFAULT                    (_USB_DOEPCTL_SNP_DEFAULT << 20)        /* Shifted mode DEFAULT for USB_DOEPCTL */
#define USB_DOEPCTL_STALL                          (0x1UL << 21)                           /* STALL Handshake */
#define _USB_DOEPCTL_STALL_SHIFT                   21                                      /* Shift value for USB_STALL */
#define _USB_DOEPCTL_STALL_MASK                    0x200000UL                              /* Bit mask for USB_STALL */
#define _USB_DOEPCTL_STALL_DEFAULT                 0x00000000UL                            /* Mode DEFAULT for USB_DOEPCTL */
#define USB_DOEPCTL_STALL_DEFAULT                  (_USB_DOEPCTL_STALL_DEFAULT << 21)      /* Shifted mode DEFAULT for USB_DOEPCTL */
#define USB_DOEPCTL_CNAK                           (0x1UL << 26)                           /* Clear NAK */
#define _USB_DOEPCTL_CNAK_SHIFT                    26                                      /* Shift value for USB_CNAK */
#define _USB_DOEPCTL_CNAK_MASK                     0x4000000UL                             /* Bit mask for USB_CNAK */
#define _USB_DOEPCTL_CNAK_DEFAULT                  0x00000000UL                            /* Mode DEFAULT for USB_DOEPCTL */
#define USB_DOEPCTL_CNAK_DEFAULT                   (_USB_DOEPCTL_CNAK_DEFAULT << 26)       /* Shifted mode DEFAULT for USB_DOEPCTL */
#define USB_DOEPCTL_SNAK                           (0x1UL << 27)                           /* Set NAK */
#define _USB_DOEPCTL_SNAK_SHIFT                    27                                      /* Shift value for USB_SNAK */
#define _USB_DOEPCTL_SNAK_MASK                     0x8000000UL                             /* Bit mask for USB_SNAK */
#define _USB_DOEPCTL_SNAK_DEFAULT                  0x00000000UL                            /* Mode DEFAULT for USB_DOEPCTL */
#define USB_DOEPCTL_SNAK_DEFAULT                   (_USB_DOEPCTL_SNAK_DEFAULT << 27)       /* Shifted mode DEFAULT for USB_DOEPCTL */
#define USB_DOEPCTL_SETD0PIDEF                     (0x1UL << 28)                           /* Set DATA0 PID / Even Frame */
#define _USB_DOEPCTL_SETD0PIDEF_SHIFT              28                                      /* Shift value for USB_SETD0PIDEF */
#define _USB_DOEPCTL_SETD0PIDEF_MASK               0x10000000UL                            /* Bit mask for USB_SETD0PIDEF */
#define _USB_DOEPCTL_SETD0PIDEF_DEFAULT            0x00000000UL                            /* Mode DEFAULT for USB_DOEPCTL */
#define USB_DOEPCTL_SETD0PIDEF_DEFAULT             (_USB_DOEPCTL_SETD0PIDEF_DEFAULT << 28) /* Shifted mode DEFAULT for USB_DOEPCTL */
#define USB_DOEPCTL_SETD1PIDOF                     (0x1UL << 29)                           /* Set DATA1 PID / Odd Frame */
#define _USB_DOEPCTL_SETD1PIDOF_SHIFT              29                                      /* Shift value for USB_SETD1PIDOF */
#define _USB_DOEPCTL_SETD1PIDOF_MASK               0x20000000UL                            /* Bit mask for USB_SETD1PIDOF */
#define _USB_DOEPCTL_SETD1PIDOF_DEFAULT            0x00000000UL                            /* Mode DEFAULT for USB_DOEPCTL */
#define USB_DOEPCTL_SETD1PIDOF_DEFAULT             (_USB_DOEPCTL_SETD1PIDOF_DEFAULT << 29) /* Shifted mode DEFAULT for USB_DOEPCTL */
#define USB_DOEPCTL_EPDIS                          (0x1UL << 30)                           /* Endpoint Disable */
#define _USB_DOEPCTL_EPDIS_SHIFT                   30                                      /* Shift value for USB_EPDIS */
#define _USB_DOEPCTL_EPDIS_MASK                    0x40000000UL                            /* Bit mask for USB_EPDIS */
#define _USB_DOEPCTL_EPDIS_DEFAULT                 0x00000000UL                            /* Mode DEFAULT for USB_DOEPCTL */
#define USB_DOEPCTL_EPDIS_DEFAULT                  (_USB_DOEPCTL_EPDIS_DEFAULT << 30)      /* Shifted mode DEFAULT for USB_DOEPCTL */
#define USB_DOEPCTL_EPENA                          (0x1UL << 31)                           /* Endpoint Enable */
#define _USB_DOEPCTL_EPENA_SHIFT                   31                                      /* Shift value for USB_EPENA */
#define _USB_DOEPCTL_EPENA_MASK                    0x80000000UL                            /* Bit mask for USB_EPENA */
#define _USB_DOEPCTL_EPENA_DEFAULT                 0x00000000UL                            /* Mode DEFAULT for USB_DOEPCTL */
#define USB_DOEPCTL_EPENA_DEFAULT                  (_USB_DOEPCTL_EPENA_DEFAULT << 31)      /* Shifted mode DEFAULT for USB_DOEPCTL */

