apache/nuttx/arch/arm/src/efm32/hardware/efm32_usb.h
/* Bit fields for USB DOEPINT */

#define _USB_DOEPINT_RESETVALUE                    0x00000000UL                               /* Default value for USB_DOEPINT */
#define _USB_DOEPINT_MASK                          0x0000385FUL                               /* Mask for USB_DOEPINT */

#define USB_DOEPINT_XFERCOMPL                      (0x1UL << 0)                               /* Transfer Completed Interrupt */
#define _USB_DOEPINT_XFERCOMPL_SHIFT               0                                          /* Shift value for USB_XFERCOMPL */
#define _USB_DOEPINT_XFERCOMPL_MASK                0x1UL                                      /* Bit mask for USB_XFERCOMPL */
#define _USB_DOEPINT_XFERCOMPL_DEFAULT             0x00000000UL                               /* Mode DEFAULT for USB_DOEPINT */
#define USB_DOEPINT_XFERCOMPL_DEFAULT              (_USB_DOEPINT_XFERCOMPL_DEFAULT << 0)      /* Shifted mode DEFAULT for USB_DOEPINT */
#define USB_DOEPINT_EPDISBLD                       (0x1UL << 1)                               /* Endpoint Disabled Interrupt */
#define _USB_DOEPINT_EPDISBLD_SHIFT                1                                          /* Shift value for USB_EPDISBLD */
#define _USB_DOEPINT_EPDISBLD_MASK                 0x2UL                                      /* Bit mask for USB_EPDISBLD */
#define _USB_DOEPINT_EPDISBLD_DEFAULT              0x00000000UL                               /* Mode DEFAULT for USB_DOEPINT */
#define USB_DOEPINT_EPDISBLD_DEFAULT               (_USB_DOEPINT_EPDISBLD_DEFAULT << 1)       /* Shifted mode DEFAULT for USB_DOEPINT */
#define USB_DOEPINT_AHBERR                         (0x1UL << 2)                               /* AHB Error */
#define _USB_DOEPINT_AHBERR_SHIFT                  2                                          /* Shift value for USB_AHBERR */
#define _USB_DOEPINT_AHBERR_MASK                   0x4UL                                      /* Bit mask for USB_AHBERR */
#define _USB_DOEPINT_AHBERR_DEFAULT                0x00000000UL                               /* Mode DEFAULT for USB_DOEPINT */
#define USB_DOEPINT_AHBERR_DEFAULT                 (_USB_DOEPINT_AHBERR_DEFAULT << 2)         /* Shifted mode DEFAULT for USB_DOEPINT */
#define USB_DOEPINT_SETUP                          (0x1UL << 3)                               /* Setup Phase Done */
#define _USB_DOEPINT_SETUP_SHIFT                   3                                          /* Shift value for USB_SETUP */
#define _USB_DOEPINT_SETUP_MASK                    0x8UL                                      /* Bit mask for USB_SETUP */
#define _USB_DOEPINT_SETUP_DEFAULT                 0x00000000UL                               /* Mode DEFAULT for USB_DOEPINT */
#define USB_DOEPINT_SETUP_DEFAULT                  (_USB_DOEPINT_SETUP_DEFAULT << 3)          /* Shifted mode DEFAULT for USB_DOEPINT */
#define USB_DOEPINT_OUTTKNEPDIS                    (0x1UL << 4)                               /* OUT Token Received When Endpoint Disabled */
#define _USB_DOEPINT_OUTTKNEPDIS_SHIFT             4                                          /* Shift value for USB_OUTTKNEPDIS */
#define _USB_DOEPINT_OUTTKNEPDIS_MASK              0x10UL                                     /* Bit mask for USB_OUTTKNEPDIS */
#define _USB_DOEPINT_OUTTKNEPDIS_DEFAULT           0x00000000UL                               /* Mode DEFAULT for USB_DOEPINT */
#define USB_DOEPINT_OUTTKNEPDIS_DEFAULT            (_USB_DOEPINT_OUTTKNEPDIS_DEFAULT << 4)    /* Shifted mode DEFAULT for USB_DOEPINT */
#define USB_DOEPINT_BACK2BACKSETUP                 (0x1UL << 6)                               /* Back-to-Back SETUP Packets Received */
#define _USB_DOEPINT_BACK2BACKSETUP_SHIFT          6                                          /* Shift value for USB_BACK2BACKSETUP */
#define _USB_DOEPINT_BACK2BACKSETUP_MASK           0x40UL                                     /* Bit mask for USB_BACK2BACKSETUP */
#define _USB_DOEPINT_BACK2BACKSETUP_DEFAULT        0x00000000UL                               /* Mode DEFAULT for USB_DOEPINT */
#define USB_DOEPINT_BACK2BACKSETUP_DEFAULT         (_USB_DOEPINT_BACK2BACKSETUP_DEFAULT << 6) /* Shifted mode DEFAULT for USB_DOEPINT */
#define USB_DOEPINT_PKTDRPSTS                      (0x1UL << 11)                              /* Packet Drop Status */
#define _USB_DOEPINT_PKTDRPSTS_SHIFT               11                                         /* Shift value for USB_PKTDRPSTS */
#define _USB_DOEPINT_PKTDRPSTS_MASK                0x800UL                                    /* Bit mask for USB_PKTDRPSTS */
#define _USB_DOEPINT_PKTDRPSTS_DEFAULT             0x00000000UL                               /* Mode DEFAULT for USB_DOEPINT */
#define USB_DOEPINT_PKTDRPSTS_DEFAULT              (_USB_DOEPINT_PKTDRPSTS_DEFAULT << 11)     /* Shifted mode DEFAULT for USB_DOEPINT */
#define USB_DOEPINT_BBLEERR                        (0x1UL << 12)                              /* Babble Error */
#define _USB_DOEPINT_BBLEERR_SHIFT                 12                                         /* Shift value for USB_BBLEERR */
#define _USB_DOEPINT_BBLEERR_MASK                  0x1000UL                                   /* Bit mask for USB_BBLEERR */
#define _USB_DOEPINT_BBLEERR_DEFAULT               0x00000000UL                               /* Mode DEFAULT for USB_DOEPINT */
#define USB_DOEPINT_BBLEERR_DEFAULT                (_USB_DOEPINT_BBLEERR_DEFAULT << 12)       /* Shifted mode DEFAULT for USB_DOEPINT */
#define USB_DOEPINT_NAKINTRPT                      (0x1UL << 13)                              /* NAK Interrupt */
#define _USB_DOEPINT_NAKINTRPT_SHIFT               13                                         /* Shift value for USB_NAKINTRPT */
#define _USB_DOEPINT_NAKINTRPT_MASK                0x2000UL                                   /* Bit mask for USB_NAKINTRPT */
#define _USB_DOEPINT_NAKINTRPT_DEFAULT             0x00000000UL                               /* Mode DEFAULT for USB_DOEPINT */
#define USB_DOEPINT_NAKINTRPT_DEFAULT              (_USB_DOEPINT_NAKINTRPT_DEFAULT << 13)     /* Shifted mode DEFAULT for USB_DOEPINT */

/* Bit fields for USB DOEPTSIZ */

