apache/nuttx/arch/arm/src/efm32/hardware/efm32_usb.h
#define _USB_DOEPTSIZ_RESETVALUE                   0x00000000UL                               /* Default value for USB_DOEPTSIZ */
#define _USB_DOEPTSIZ_MASK                         0x7FFFFFFFUL                               /* Mask for USB_DOEPTSIZ */

#define _USB_DOEPTSIZ_XFERSIZE_SHIFT               0                                          /* Shift value for USB_XFERSIZE */
#define _USB_DOEPTSIZ_XFERSIZE_MASK                0x7FFFFUL                                  /* Bit mask for USB_XFERSIZE */
#define _USB_DOEPTSIZ_XFERSIZE_DEFAULT             0x00000000UL                               /* Mode DEFAULT for USB_DOEPTSIZ */
#define USB_DOEPTSIZ_XFERSIZE_DEFAULT              (_USB_DOEPTSIZ_XFERSIZE_DEFAULT << 0)      /* Shifted mode DEFAULT for USB_DOEPTSIZ */
#define _USB_DOEPTSIZ_PKTCNT_SHIFT                 19                                         /* Shift value for USB_PKTCNT */
#define _USB_DOEPTSIZ_PKTCNT_MASK                  0x1FF80000UL                               /* Bit mask for USB_PKTCNT */
#define _USB_DOEPTSIZ_PKTCNT_DEFAULT               0x00000000UL                               /* Mode DEFAULT for USB_DOEPTSIZ */
#define USB_DOEPTSIZ_PKTCNT_DEFAULT                (_USB_DOEPTSIZ_PKTCNT_DEFAULT << 19)       /* Shifted mode DEFAULT for USB_DOEPTSIZ */
#define _USB_DOEPTSIZ_RXDPIDSUPCNT_SHIFT           29                                         /* Shift value for USB_RXDPIDSUPCNT */
#define _USB_DOEPTSIZ_RXDPIDSUPCNT_MASK            0x60000000UL                               /* Bit mask for USB_RXDPIDSUPCNT */
#define _USB_DOEPTSIZ_RXDPIDSUPCNT_DEFAULT         0x00000000UL                               /* Mode DEFAULT for USB_DOEPTSIZ */
#define _USB_DOEPTSIZ_RXDPIDSUPCNT_DATA0           0x00000000UL                               /* Mode DATA0 for USB_DOEPTSIZ */
#define _USB_DOEPTSIZ_RXDPIDSUPCNT_DATA2           0x00000001UL                               /* Mode DATA2 for USB_DOEPTSIZ */
#define _USB_DOEPTSIZ_RXDPIDSUPCNT_DATA1           0x00000002UL                               /* Mode DATA1 for USB_DOEPTSIZ */
#define _USB_DOEPTSIZ_RXDPIDSUPCNT_MDATA           0x00000003UL                               /* Mode MDATA for USB_DOEPTSIZ */
#define USB_DOEPTSIZ_RXDPIDSUPCNT_DEFAULT          (_USB_DOEPTSIZ_RXDPIDSUPCNT_DEFAULT << 29) /* Shifted mode DEFAULT for USB_DOEPTSIZ */
#define USB_DOEPTSIZ_RXDPIDSUPCNT_DATA0            (_USB_DOEPTSIZ_RXDPIDSUPCNT_DATA0 << 29)   /* Shifted mode DATA0 for USB_DOEPTSIZ */
#define USB_DOEPTSIZ_RXDPIDSUPCNT_DATA2            (_USB_DOEPTSIZ_RXDPIDSUPCNT_DATA2 << 29)   /* Shifted mode DATA2 for USB_DOEPTSIZ */
#define USB_DOEPTSIZ_RXDPIDSUPCNT_DATA1            (_USB_DOEPTSIZ_RXDPIDSUPCNT_DATA1 << 29)   /* Shifted mode DATA1 for USB_DOEPTSIZ */
#define USB_DOEPTSIZ_RXDPIDSUPCNT_MDATA            (_USB_DOEPTSIZ_RXDPIDSUPCNT_MDATA << 29)   /* Shifted mode MDATA for USB_DOEPTSIZ */

/* Bit fields for USB DOEPDMAADDR */

#define _USB_DOEPDMAADDR_RESETVALUE                0x00000000UL                            /* Default value for USB_DOEPDMAADDR */
#define _USB_DOEPDMAADDR_MASK                      0xFFFFFFFFUL                            /* Mask for USB_DOEPDMAADDR */

#define _USB_DOEPDMAADDR_DMAADDR_SHIFT             0                                       /* Shift value for USB_DMAADDR */
#define _USB_DOEPDMAADDR_DMAADDR_MASK              0xFFFFFFFFUL                            /* Bit mask for USB_DMAADDR */
#define _USB_DOEPDMAADDR_DMAADDR_DEFAULT           0x00000000UL                            /* Mode DEFAULT for USB_DOEPDMAADDR */
#define USB_DOEPDMAADDR_DMAADDR_DEFAULT            (_USB_DOEPDMAADDR_DMAADDR_DEFAULT << 0) /* Shifted mode DEFAULT for USB_DOEPDMAADDR */

/* Bit fields for USB PCGCCTL */

#define _USB_PCGCCTL_RESETVALUE                    0x00000000UL                               /* Default value for USB_PCGCCTL */
#define _USB_PCGCCTL_MASK                          0x0000014FUL                               /* Mask for USB_PCGCCTL */

#define USB_PCGCCTL_STOPPCLK                       (0x1UL << 0)                               /* Stop PHY clock */
#define _USB_PCGCCTL_STOPPCLK_SHIFT                0                                          /* Shift value for USB_STOPPCLK */
#define _USB_PCGCCTL_STOPPCLK_MASK                 0x1UL                                      /* Bit mask for USB_STOPPCLK */
#define _USB_PCGCCTL_STOPPCLK_DEFAULT              0x00000000UL                               /* Mode DEFAULT for USB_PCGCCTL */
#define USB_PCGCCTL_STOPPCLK_DEFAULT               (_USB_PCGCCTL_STOPPCLK_DEFAULT << 0)       /* Shifted mode DEFAULT for USB_PCGCCTL */
#define USB_PCGCCTL_GATEHCLK                       (0x1UL << 1)                               /* Gate HCLK */
#define _USB_PCGCCTL_GATEHCLK_SHIFT                1                                          /* Shift value for USB_GATEHCLK */
#define _USB_PCGCCTL_GATEHCLK_MASK                 0x2UL                                      /* Bit mask for USB_GATEHCLK */
#define _USB_PCGCCTL_GATEHCLK_DEFAULT              0x00000000UL                               /* Mode DEFAULT for USB_PCGCCTL */
#define USB_PCGCCTL_GATEHCLK_DEFAULT               (_USB_PCGCCTL_GATEHCLK_DEFAULT << 1)       /* Shifted mode DEFAULT for USB_PCGCCTL */
#define USB_PCGCCTL_PWRCLMP                        (0x1UL << 2)                               /* Power Clamp */
#define _USB_PCGCCTL_PWRCLMP_SHIFT                 2                                          /* Shift value for USB_PWRCLMP */
#define _USB_PCGCCTL_PWRCLMP_MASK                  0x4UL                                      /* Bit mask for USB_PWRCLMP */
#define _USB_PCGCCTL_PWRCLMP_DEFAULT               0x00000000UL                               /* Mode DEFAULT for USB_PCGCCTL */
#define USB_PCGCCTL_PWRCLMP_DEFAULT                (_USB_PCGCCTL_PWRCLMP_DEFAULT << 2)        /* Shifted mode DEFAULT for USB_PCGCCTL */
#define USB_PCGCCTL_RSTPDWNMODULE                  (0x1UL << 3)                               /* Reset Power-Down Modules */
#define _USB_PCGCCTL_RSTPDWNMODULE_SHIFT           3                                          /* Shift value for USB_RSTPDWNMODULE */
#define _USB_PCGCCTL_RSTPDWNMODULE_MASK            0x8UL                                      /* Bit mask for USB_RSTPDWNMODULE */
#define _USB_PCGCCTL_RSTPDWNMODULE_DEFAULT         0x00000000UL                               /* Mode DEFAULT for USB_PCGCCTL */
#define USB_PCGCCTL_RSTPDWNMODULE_DEFAULT          (_USB_PCGCCTL_RSTPDWNMODULE_DEFAULT << 3)  /* Shifted mode DEFAULT for USB_PCGCCTL */
#define USB_PCGCCTL_PHYSLEEP                       (0x1UL << 6)                               /* PHY In Sleep */
#define _USB_PCGCCTL_PHYSLEEP_SHIFT                6                                          /* Shift value for USB_PHYSLEEP */
#define _USB_PCGCCTL_PHYSLEEP_MASK                 0x40UL                                     /* Bit mask for USB_PHYSLEEP */
#define _USB_PCGCCTL_PHYSLEEP_DEFAULT              0x00000000UL                               /* Mode DEFAULT for USB_PCGCCTL */
#define USB_PCGCCTL_PHYSLEEP_DEFAULT               (_USB_PCGCCTL_PHYSLEEP_DEFAULT << 6)       /* Shifted mode DEFAULT for USB_PCGCCTL */
#define USB_PCGCCTL_RESETAFTERSUSP                 (0x1UL << 8)                               /* Reset after suspend */
#define _USB_PCGCCTL_RESETAFTERSUSP_SHIFT          8                                          /* Shift value for USB_RESETAFTERSUSP */
#define _USB_PCGCCTL_RESETAFTERSUSP_MASK           0x100UL                                    /* Bit mask for USB_RESETAFTERSUSP */
#define _USB_PCGCCTL_RESETAFTERSUSP_DEFAULT        0x00000000UL                               /* Mode DEFAULT for USB_PCGCCTL */
#define USB_PCGCCTL_RESETAFTERSUSP_DEFAULT         (_USB_PCGCCTL_RESETAFTERSUSP_DEFAULT << 8) /* Shifted mode DEFAULT for USB_PCGCCTL */

/* Bit fields for USB FIFO0D */

#define _USB_FIFO0D_RESETVALUE                     0x00000000UL                      /* Default value for USB_FIFO0D */
#define _USB_FIFO0D_MASK                           0xFFFFFFFFUL                      /* Mask for USB_FIFO0D */

